{
  "@context": {
    "@language": "en",
    "CIP100": "https://github.com/cardano-foundation/CIPs/blob/master/CIP-0100/README.md#",
    "CIP108": "https://github.com/cardano-foundation/CIPs/blob/master/CIP-0108/README.md#",
    "intersectSpec": "https://github.com/IntersectMBO/governance-actions/blob/main/schemas/specification.md#",
    "hashAlgorithm": "CIP100:hashAlgorithm",
    "body": {
      "@id": "CIP108:body",
      "@context": {
        "references": {
          "@id": "CIP108:references",
          "@container": "@set",
          "@context": {
            "GovernanceMetadata": "CIP100:GovernanceMetadataReference",
            "Other": "CIP100:OtherReference",
            "label": "CIP100:reference-label",
            "uri": "CIP100:reference-uri",
            "referenceHash": {
              "@id": "CIP108:referenceHash",
              "@context": {
                "hashDigest": "CIP108:hashDigest",
                "hashAlgorithm": "CIP100:hashAlgorithm"
              }
            }
          }
        },
        "title": "CIP108:title",
        "abstract": "CIP108:abstract",
        "motivation": "CIP108:motivation",
        "rationale": "CIP108:rationale",
        "onChain": {
          "@id": "intersectSpec:onChain",
          "@context": {
            "governanceActionType": "intersectSpec:governanceActionType",
            "depositReturnAddress": "intersectSpec:depositReturnAddress",
            "withdrawals": {
              "@id": "intersectSpec:withdrawals",
              "@container": "@set",
              "@context": {
                "withdrawalAddress": "intersectSpec:withdrawalAddress",
                "withdrawalAmount": "intersectSpec:withdrawalAmount"
              }
            }
          }
        }
      }
    },
    "authors": {
      "@id": "CIP100:authors",
      "@container": "@set",
      "@context": {
        "name": "http://xmlns.com/foaf/0.1/name",
        "witness": {
          "@id": "CIP100:witness",
          "@context": {
            "witnessAlgorithm": "CIP100:witnessAlgorithm",
            "publicKey": "CIP100:publicKey",
            "signature": "CIP100:signature"
          }
        }
      }
    }
  },
  "authors": [
    {
      "name": "Snek Foundation",
      "witness": {
        "witnessAlgorithm": "CIP-0008",
        "publicKey": "3862f79dfe88a8b921c36b242d4359d7d535332e47437ffe2cca06703c4414eb",
        "signature": "84582aa201276761646472657373581de128e35801c889b56600b218e29080235e3172f6da9fa06b0d6e0cb049a166686173686564f458205e54228449f56f5ed7746f082fc2c42caf486c3c3ef5aab25e384735997d57fc584042132cc9b16646f360df1dfac58ef18a7bdf3fcc7e967b6791c112776b08d46ec15aed2c771bac112b0efae8d0e724f1519ff7e7001cffb8e0f843983545fc0e"
      }
    },
    {
      "name": "Intersect",
      "witness": {
        "witnessAlgorithm": "ed25519",
        "publicKey": "05568f86955e65c1a59df5ac1985449b167c3828dccd00b3da9df36a1cf1c743",
        "signature": "405c91280c160ec43498c1ae3bdae17079410b6c2f4af402ecff8d815bfc7e920219a117da14b89d1c40c8f13b70418e34077eaec3b60b4b8f24fa65e178560d"
      }
    }
  ],
  "hashAlgorithm": "blake2b-256",
  "body": {
    "title": "Budget: ₳5M Loan for Cardano's Global Listing Expansion - Powered by Snek",
    "abstract": "This proposal seeks a 5,000,000 ada budget loan from the Cardano Treasury to fund the Cardano Global Listing Expansion, a strategic initiative led by the Snek Foundation to list [SNEK](https://www.snek.com/) on top-tier centralized exchanges, retail brokers, and trading platforms. This proposal is the **first-ever loan-based treasury withdrawal** in Cardano governance, introducing a new model of accountability where funds are not given as grants but repaid with interest.\n\nAs part of the governance process, a Board of Advisors will be appointed to ensure transparent execution and maximize ecosystem alignment. This board will include high-profile industry veterans like Tal Cohen (former CEO of Kraken), Phillip Pon (CEO of Emurgo), Fahmi Syed (President of Midnight Foundation), and Frederik Gregaard (CEO of Cardano Foundation), with additional top-tier names to be announced.\n\n*SNEK is the largest community token on Cardano, holding the highest market capitalization, over 42,000 wallets, and more than 2 billion ADA in all-time trading volume.*\n\nOver the past two years, the Snek Foundation has already invested over $4.5 million, entirely self-funded, to secure major exchange listings. Snek delivered the first, second, and third-ever Tier 1 listings for any Cardano native token, with Kraken, Crypto.com, and Kucoin, setting historic precedents for the ecosystem. With this proposal and with the support of our partners, we aim to unlock greater visibility, liquidity, and accessibility for the broader Cardano ecosystem by leveraging SNEK's proven momentum and market position.\n\nThis loan will be repaid from Snek product revenues and business ventures with the final balance plus interest settled in three to five years, following a closing audit to confirm the loan has been repaid in full. Interest is set at 2.44% annualized (2.37% staking rate + 0.07%), compounded yearly.\n\nBy structuring this as a repayable loan, the Snek Foundation is once again trailblazing for the ecosystem; demonstrating how treasury capital can be deployed responsibly while setting a precedent for future projects. The administrator of the budget funds will be Intersect.",
    "motivation": "## Who we are\n\nSnek Foundation is a grassroots organization responsible for launching and maintaining the SNEK ecosystem. Snek has never raised external funds for exchange listings and has operated for the past 29 months, entirely self-funded through its revenue and treasury.\n\nSo far, more than $ 4.5 million has been invested by the Snek Foundation towards listing activities.\n\n**Since May 2023, Snek has:**\n\n- 42,000+ wallets holding SNEK --- the most actively held token on Cardano\n\n- 2,000,000,000 ADA in all-time trading volume --- the most traded token on Cardano\n\n- SNEK is the most well-known token in and out of the Cardano ecosystem, with 30 markets\n\n- Self-funded $4.5M for exchange listing activities\n\n- Delivered the three first-ever Tier 1 exchange listings for Cardano via Kraken, Crypto.com, and Kucoin.\n\n- Developed the first-ever CEX-DEX market-making service with Flowdesk\n\n- Launched Snek.fun, Cardano's leading launchpad, driving over 30% of all chain trades since inception\n\n- Trademarked brand with ongoing IP licensing deals (Snek Figures, Snek Energy)\n\nThe team has a successful track record negotiating listings, building tools, and driving global meme adoption aligned with Cardano's values.\n\n## Why this proposal matters\n\nSNEK is Cardano's most adopted token, yet it remains underrepresented on major centralized exchanges, reflecting a broader lack of visibility for Cardano on mainstream platforms and among broader audiences.\n\nThis underrepresentation doesn't just affect SNEK. It weakens Cardano's position in competitive markets and slows ecosystem-wide growth in four key areas:\n\n1.  ADA's visibility and liquidity on global platforms\n\n2.  Cardano's competitiveness in retail-driven market cycles\n\n3.  The discoverability of Cardano's ecosystem by mainstream users\n\n4.  CNT adoption and the path for other tokens to reach similar success\n\nCardano currently lacks a flagship token that drives liquidity, virality, and culture across exchange listings, just like DOGE, SHIBA, and PEPE do for Ethereum and Solana.\n\nSNEK has already shown it can fill this role; now it needs support to break through at scale.\n\n**This proposal aims to address the following challenges:**\n\n- **Lack of exchange presence for Cardano native tokens:** Most major centralized exchanges and retail brokers still do not support Cardano Native Tokens (CNTs). This severely limits Cardano's accessibility and competitiveness on a global scale. While Ethereum and Solana ecosystems enjoy deep integrations with top exchanges, Cardano-native projects are left with fewer liquidity pathways and less discoverability. Until CNTs are more visible on mainstream platforms, Cardano's on-chain economy cannot reach its full potential.\n\n- **Low visibility for ADA pairings:** Centralized exchanges are the primary entry point for millions of users, yet ADA trading pairs are underrepresented relative to Cardano's market cap. Without community-driven assets like SNEK creating demand for ADA pairings, liquidity remains shallow and volume muted. This proposal helps bootstrap those pairings, supporting deeper ADA liquidity and reinforcing Cardano's relevance at the trading layer.\n\n- **Missed user acquisition:** In other ecosystems, memecoins like SHIB, DOGE, and PEPE have served as cultural gateways for millions of new retail users. These tokens create stories, engagement, and participation, driving demand for the base layer tokens and ecosystem tools. SNEK has proven it can play that role for Cardano. Without support to elevate its accessibility, Cardano risks missing this powerful user acquisition funnel.\n\n- **Liquidity fragmentation:** Cardano's DeFi protocols face high barriers to liquidity aggregation due to the lack of bridgeable, on-ramp-compatible assets. Without listings on major exchanges, Cardano native assets remain siloed and isolated from the broader crypto capital flows, limiting scalability and adoption.\n\nBy funding this initiative, Cardano positions itself to solve these bottlenecks through a trusted, culturally strong and community-proven asset that can serve as a gateway for users and liquidity.\n\nToday, Snek is the only Cardano-native token capable of meeting Tier 1 exchange requirements. This makes it the best and currently only viable gateway to unlock the access, liquidity, and visibility Cardano needs at the global level.\n\nThe goal is not exclusivity --- it's scalability. By leading the way through Snek, we create a repeatable path for other CNTs to follow. The foundation has already begun sharing its knowledge with other projects post-Kraken, and through this proposal, will continue building and systematizing resources that can be shared with Cardano Foundation, Emurgo, and IOG.",
    "rationale": "## Executive summary\n\nThe [SNEK](https://www.snek.com/) Global Exchange Expansion initiative will execute a targeted listing strategy, using the requested 5M ADA to:\n\n- Finalize negotiations and secure multiple top-tier listings on centralized exchanges, retail brokers, and innovative DeFi platforms\n\n- Provision liquidity and market making for ADA/SNEK pairs\n\n- Cover legal and compliance costs to meet exchange requirements\n\n- Fund mandatory coordination and announcement campaigns\n\n- Report expenditures and impact transparently to the community\n\n### Ecosystem Benefits:\n\n- **Increase ADA liquidity across global trading platforms:** Listings will establish deep liquidity for ADA/SNEK pairs and reinforce ADA's role as a quote asset in broader markets.\n\n- **Expand Cardano visibility among mainstream users:** Presence on Tier 1 CEXs and retail platforms will increase Cardano's exposure where most crypto adoption begins.\n\n- **Establish reusable exchange infrastructure for CNTs:** This initiative creates the legal, technical, and operational framework that future Cardano tokens can leverage.\n\n- **Lay the technical and legal groundwork for future Cardano token listings:** This initiative solves the hardest and most expensive part of Tier 1 onboarding the integrations, KYC, and compliance infrastructure that every CNT would otherwise need to build from scratch. Once completed, this framework can be reused by future projects, massively reducing the technical lift required for Cardano wide exchange access.\n\n- **Drive user acquisition through proven community traction:** Snek's viral momentum helps Cardano tap into the same memecoin fueled onboarding funnels that propelled DOGE and SHIB.\n\n- **Create liquidity bridges for DeFi, NFTs, L2s, and dApps:** Expanded listings make it easier to onboard capital and users into Cardano-native protocols:\n\n- **Document and share listing playbooks with the ecosystem:** All compliance, negotiation, and integration learnings will be captured and shared with the Cardano Foundation and other token teams to accelerate future listings.\n\n### Cardano Treasury and Governance:\n\n- High ROI use of funds by leveraging SNEK as a magnet for adoption\n\n- Support of a community-run initiative with a proven track record\n\n- Back a team that has already invested more than $4.5 million of its own capital into this initiative, and remains committed to continued investment alongside community support.\n\nThe loan will only be used to cover necessary expenses to achieve key listings.\n\nThese costs can vary from one listing to another, but generally include:\n\n- Listing Fees\n\n- Liquidity Provisioning\n\n- Legal & Compliance\n\n- Marketing & Campaign budgets (led by the exchanges)\n\n- Advisory & Transparency Ops\n\nThis loan will be repaid continuously to the treasury from Snek network activities and settled in full after no longer than 5 years from the reception of the funds.\n\n## Loan terms\n\n**Principal:** 5 million ADA\n\n**Interest Rate:** 2.44% APR The loan will accrue interest at the current average Cardano staking rewards rate of 2.37% per year, plus an additional 0.07% as a gesture of good faith\n\n**Repayment Timeline:** Repayments will be made continuously to the Cardano Treasury through multiple ways, including but not limited to: Snek product revenues and business ventures, with direct payments coming from the Snek Foundation treasury. Early payments may begin at any time and loan repayment must commence no later than the last day of year 3.\n\n**Audit & Review:** At the end of year 3, an independent audit will be conducted to review the repayments already made. The audit will verify the amounts reimbursed to date, calculate any outstanding principal and interest, and establish a repayment schedule to ensure the full balance is repaid over the remaining years.\n\n**Default & Enforcement:** In the unlikely event of non-repayment, the obligation will remain enforceable under the binding loan agreement administered by Intersect on behalf of the Treasury. Remedies and next steps would follow the terms of that contract.\n\n**Loan Maturity:** The full loan (principal + interest) must be repaid in full within 5 years from the date of disbursement.\n\n## Administration of the loan\n\nThe administrator of the budget funds will be Intersect, offering continuous oversight. Expenditures will be tracked against the stated use of funds, with reporting, receipts, and independent audits ensuring that spending remains aligned with the proposal's objectives. This approach provides the flexibility required to execute global listings while still offering the Treasury transparent, phased accountability.\n\nAdditionally, a Board of Advisors will be appointed to provide guidance, feedback, and external validation.\n\n**The board will include:**\n\n- Tal Cohen, former CEO of Kraken\n\n- Frederik Gregaard, CEO of Cardano Foundation\n\n- Phillip Pon, CEO of Emurgo\n\n- Fahmi Syed, President of Midnight Foundation\n\n- Rapha C-Roy, CEO of Snek Foundation\n\n**The board's responsibilities:**\n\n- Advise key expenses\n\n- Guide negotiations and legal strategy\n\n- Ensure alignment with Cardano treasury goals\n\n- Ensure outcomes benefit the Cardano ecosystem beyond SNEK\n\n- Support documentation and distribution of listing playbooks to future Cardano-native token teams\n\nThis structure ensures that the project benefits from experienced external input while maintaining decentralized, community-led control over treasury execution.\n\nThe Board will also help facilitate knowledge sharing across the ecosystem by supporting documentation of listing procedures, exchange engagement strategy, and compliance best practices, enabling other Cardano native projects to benefit from this groundwork.\n\nAn allocation of 30-50k ADA per year will be reserved out of the 5M for yearly independent external audit reports, ensuring that the loan is transparently monitored and fully accountable to the Treasury.\n\n## Reporting\n\n#### Bi-Yearly Reports\n\nSnek Foundation will publish bi-yearly updates including:\n\n- Progress on exchange listings\n\n- Funds spent with receipts when allowed\n\n- All legal/compliance materials will be open-sourced when possible\n\n- Learnings from legal, compliance, and integration processes\n\n- Results of independent external audits\n\n#### Knowledge Sharing\n\nAll listing playbooks, integration frameworks, and documentation will be made available to the Cardano Foundation, Emurgo, IOG, and future token teams. Progress will be shared during regular Cardano town halls and across governance channels to maintain transparency and feedback loops to the best of our ability and within contractual regulations.\n\n#  \n\n# Conclusion\n\nThe Snek Foundation has already proven its commitment to Cardano, investing over $4.5M of its own funds into the exact initiative now being proposed for co-funding. This request is not about raising capital for a single token; it is about funding infrastructure, visibility, and adoption for the entire Cardano ecosystem.\n\nThis is not a grant; it is a loan, to be repaid in full with interest, demonstrating our commitment to accountability and sustainability. With dedicated budget allocations for independent audits and transparent reporting, the Treasury will be able to monitor progress, repayments, and compliance throughout the loan term, ensuring this initiative delivers both measurable impact and accountability.\n\n[SNEK](https://www.snek.com/) is currently the only Cardano-native asset that meets Tier 1 exchange requirements.\n\nSupporting this proposal unlocks:\n\n- Immediate listings with global reach\n\n- Deep ADA pair liquidity\n\n- Repeatable frameworks for future CNTs\n\nThe time to act is now.\n\nThe market is receptive, Snek has momentum, and the Cardano ecosystem is ready to scale its visibility. This proposal is how we turn years of effort into lasting, reusable infrastructure.\n\n## Constitutionality checklist\n\n#### Purpose\n\n- This proposal is for work intended to enhance the security, decentralization and long-term sustainability of Cardano.\n\n#### Article III.5: the process of on-chain governance\n\n- Proposal is submitted in a legible, standardized format and includes rationale, budget, administration plan, and reporting framework.\n\n#### Article IV.1: proposing budgets\n\n- This proposal supports Cardano blockchain adoption, liquidity, and token infrastructure.\n\n#### Article IV.2: funds administration\n\n- This proposal specifies an administrator in accordance with this provision. The budget is administered and documented by a named party (Intersect), with oversight of an off-chain committee (board of trusted advisors).\n\n#### Article IV.3: Net-Change Limit\n\n- Being of ₳5M and covering the second half of 2025, this proposal and the treasury withdrawals it would enable do not violate the currently agreed upon Net-Change Limit.\n\n#### Article IV.4: Auditor\n\n- This proposal makes provisions for an auditor: An allocation of 30-50k ADA per year will be reserved for yearly independent external audit reports, ensuring that the loan is transparently monitored and fully accountable to the Treasury.\n\n#### Guardrails\n\n- This proposal is subject to TREASURY-04a in that it defines a Cardano blockchain ecosystem budget. It requires a threshold greater than 50% of the DReps' active voting stake to be considered approved and enable subsequent withdrawals pertaining to this budget.",
    "references": [
      {
        "@type": "Other",
        "label": "Snek Foundation (Website)",
        "uri": "https://www.snek.com/"
      },
      {
        "@type": "Other",
        "label": "Snek Foundation (X)",
        "uri": "https://x.com/snek"
      },
      {
        "@type": "Other",
        "label": "Rapha C-Roy, CEO @ Snek Foundation",
        "uri": "https://www.linkedin.com/in/raphacroy/"
      },
      {
        "@type": "Other",
        "label": "Tal Cohen, former CEO of Kraken",
        "uri": "https://www.linkedin.com/in/talcohenprofile/"
      },
      {
        "@type": "Other",
        "label": "Frederik Gregaard, CEO of Cardano Foundation",
        "uri": "https://www.linkedin.com/in/gregaard/"
      },
      {
        "@type": "Other",
        "label": "Phillip Pon, CEO of Emurgo",
        "uri": "https://www.linkedin.com/in/phillip-pon-89666a2/"
      },
      {
        "@type": "Other",
        "label": "Fahmi Syed, President of Midnight Foundation",
        "uri": "https://www.linkedin.com/in/fahmi-s-694b5414b/"
      }
    ],
    "onChain": {
      "governanceActionType": "info",
      "depositReturnAddress": "stake1uy5wxkqpezym2esqkgvw9yyqyd0rzuhkm206q6cddcxtqjgehj9ty"
    }
  }
}
