{
  "@context": {
    "@language": "en-us",
    "CIP100": "https://github.com/cardano-foundation/CIPs/blob/master/CIP-0100/README.md#",
    "CIP136": "https://github.com/cardano-foundation/CIPs/blob/master/CIP-0136/README.md#",
    "hashAlgorithm": "CIP100:hashAlgorithm",
    "body": {
      "@id": "CIP136:body",
      "@context": {
        "references": {
          "@id": "CIP100:references",
          "@container": "@set",
          "@context": {
            "GovernanceMetadata": "CIP100:GovernanceMetadataReference",
            "Other": "CIP100:OtherReference",
            "label": "CIP100:reference-label",
            "uri": "CIP100:reference-uri",
            "RelevantArticles": "CIP136:RelevantArticles"
          }
        },
        "summary": "CIP136:summary",
        "rationaleStatement": "CIP136:rationaleStatement",
        "precedentDiscussion": "CIP136:precedentDiscussion",
        "counterargumentDiscussion": "CIP136:counterargumentDiscussion",
        "conclusion": "CIP136:conclusion",
        "internalVote": {
          "@id": "CIP136:internalVote",
          "@container": "@set",
          "@context": {
            "constitutional": "CIP136:constitutional",
            "unconstitutional": "CIP136:unconstitutional",
            "abstain": "CIP136:abstain",
            "didNotVote": "CIP136:didNotVote",
            "againstVote": "CIP136:againstVote"
          }
        }
      }
    },
    "authors": {
      "@id": "CIP100:authors",
      "@container": "@set",
      "@context": {
        "did": "@id",
        "name": "http://xmlns.com/foaf/0.1/name",
        "witness": {
          "@id": "CIP100:witness",
          "@context": {
            "witnessAlgorithm": "CIP100:witnessAlgorithm",
            "publicKey": "CIP100:publicKey",
            "signature": "CIP100:signature"
          }
        }
      }
    }
  },
  "hashAlgorithm": "blake2b-256",
  "body": {
    "govActionId": "gov_action1u4jrcvlkppjzuv5j9z5ksacwtvv77h6glu0knpcjut8gvjjfu0cqqt3alsy",
    "summary": "Tingvard judge the “Stablecoin DeFi Liquidity Budget” budget Info action constitutional.",
    "rationaleStatement": "This governance action is properly framed as a budget Info action under Article III, § 4 and Article IV, § 1. It defines a budget period of 73 epochs, specifies objectives — namely increasing stablecoin liquidity and generating revenue for the treasury — and provides supporting materials, URLs, and hashes as required by Article III, § 5. It does not itself authorise treasury withdrawals but establishes the constitutional framework for future withdrawal actions. The proposal satisfies the structural requirements of Article IV, § 2 through § 5. It identifies a nine-member committee as the budget administrator and details oversight mechanisms through a treasury DAO (tDAO) composed of DReps (Article IV, § 2). It allocates resources for smart contract development and auditing and commits to transparent monthly reporting (Article IV, § 4). Custody practices are clearly defined, with assets held in a smart contract and delegated to the auto-abstain DRep option, meeting the requirements of Article IV, § 5. The requested 50 million Ada is also declared to be within the Net-Change Limit under Article IV, § 3. The proposal’s stated purpose — to bootstrap stablecoin liquidity and strengthen Cardano’s DeFi ecosystem — directly advances the Tenets of sustainability and ecosystem development. Deepening liquidity and creating feedback loops that attract market makers are aligned with the constitutional goals of promoting ecosystem growth and broadening participation. However, Tingvard notes significant constitutional considerations. The proposal involves deploying a large portion of the treasury into external DeFi protocols and converting Ada into fiat-backed stablecoins. This introduces risks of loss, counterparty exposure, and operational complexity that must be managed within the constitutional guardrails. Article IV, § 5 obliges the governance system to safeguard treasury resources and ensure transparency, and these obligations must guide every subsequent withdrawal and operational decision. The governance design also delegates substantial discretion to a nine-member committee. While the tDAO retains the power to impeach committee members, halt fund operations, or dissolve the fund, the effective exercise of those powers will be essential to maintain decentralisation and prevent concentration of authority — a core requirement under Article II, § 3 and Tenet 9. Oversight must be continuous, enforceable, and transparent to ensure that treasury assets are managed for the public good and not captured by narrow interests.",
    "precedentDiscussion": "This decision affirms that budget Info actions proposing innovative structures — including treasury-funded liquidity operations, oversight DAOs, and structured deployment mechanisms — can be constitutional provided they remain accountable to the governance framework and comply with Article IV, § 1 through § 5. It also clarifies that treasury-funded initiatives aimed at strengthening Cardano’s financial infrastructure fall within the permissible scope of “operation, maintenance, and development” defined in Article IV, § 1. At the same time, this action sets an important precedent by testing the constitutional boundaries of scale and delegation. Large-scale treasury deployment into dynamic financial environments requires heightened scrutiny and robust safeguards. Future withdrawal actions associated with this budget must demonstrate that risk management, transparency, and decentralised oversight remain firmly in place.",
    "counterargumentDiscussion": "One argument against constitutionality is that the scale of the budget and the concentration of decision-making authority in a small committee could risk centralising power or mismanaging funds. This raises a potential point of conflict with the tenets of the Constitution. However, the Constitution permits flexible budget structures (Article IV, § 1) and does not prohibit the delegation of operational responsibilities, provided oversight mechanisms remain effective. The presence of the tDAO as an oversight body, with the ability to remove committee members, halt operations, or shut down the fund entirely, ensures ultimate accountability to the community. A further counterargument concerns treasury risk exposure. Deploying funds into DeFi protocols and converting Ada to stablecoins introduces financial and operational risks. Yet Article IV, § 5 does not forbid risk-taking; it mandates that funds be safeguarded and transparently managed. If subsequent withdrawal actions continue to respect these principles — including comprehensive auditing, transparent reporting, and public oversight — the constitutional requirements will remain satisfied.",
    "conclusion": "Tingvard finds this budget Info action constitutional. It conforms to Article III, § 4–5, and Article IV, § 1–5 and aligns with the Tenets of sustainability, decentralisation, and ecosystem development. The governance design provides for community oversight, transparent auditing, and constitutionally compliant custody practices.",
    "internalVote": {
      "constitutional": 5,
      "unconstitutional": 0,
      "abstain": 1,
      "didNotVote": 0,
      "againstVote": 0
    },
    "references": [
      {
        "@type": "Other",
        "label": "Cardano Blockchain Ecosystem Constitution",
        "uri": "ipfs://bafkreiazhhawe7sjwuthcfgl3mmv2swec7sukvclu3oli7qdyz4uhhuvmy"
      }
    ]
  },
  "authors": [
    {
      "name": "Tingvard"
    }
  ]
}
