{
  "@context": {
    "@language": "en",
    "CIP100": "https://github.com/cardano-foundation/CIPs/blob/master/CIP-0100/README.md#",
    "CIP136": "https://github.com/cardano-foundation/CIPs/blob/master/CIP-0136/README.md#",
    "hashAlgorithm": "CIP100:hashAlgorithm",
    "body": {
      "@id": "CIP136:body",
      "@context": {
        "references": {
          "@id": "CIP100:references",
          "@container": "@set",
          "@context": {
            "GovernanceMetadata": "CIP100:GovernanceMetadataReference",
            "Other": "CIP100:OtherReference",
            "label": "CIP100:reference-label",
            "uri": "CIP100:reference-uri",
            "RelevantArticles": "CIP136:RelevantArticles"
          }
        },
        "summary": "CIP136:summary",
        "rationaleStatement": "CIP136:rationaleStatement",
        "precedentDiscussion": "CIP136:precedentDiscussion",
        "counterargumentDiscussion": "CIP136:counterargumentDiscussion",
        "conclusion": "CIP136:conclusion",
        "internalVote": {
          "@id": "CIP136:internalVote",
          "@container": "@set",
          "@context": {
            "constitutional": "CIP136:constitutional",
            "unconstitutional": "CIP136:unconstitutional",
            "abstain": "CIP136:abstain",
            "didNotVote": "CIP136:didNotVote"
          }
        }
      }
    },
    "authors": {
      "@id": "CIP100:authors",
      "@container": "@set",
      "@context": {
        "did": "@id",
        "name": "http://xmlns.com/foaf/0.1/name",
        "witness": {
          "@id": "CIP100:witness",
          "@context": {
            "witnessAlgorithm": "CIP100:witnessAlgorithm",
            "publicKey": "CIP100:publicKey",
            "signature": "CIP100:signature"
          }
        }
      }
    }
  },
  "hashAlgorithm": "blake2b-256",
  "body": {
    "summary": "We have determined that this Info Action does not meet the criteria deemed necessary for the Constitutional Committee to assess its constitutionality.",
    "rationaleStatement": "### Consideration 1\nArticle VI Section 1 of the Cardano Blockchain Ecosystem Interim Constitution states \"The Constitutional Committee shall comprise a set of Ada holders that is collectively responsible for ensuring that on-chain governance actions prior to enactment on-chain, are constitutional.\"\n\nGiven that \"Info\" actions cannot be enacted on-chain, a strict interpretation could be that the Constitutional Committee does not have to assess the constitutionality of \"Info\" governance actions.\n### Consideration 2\nArticle III Section 5 of the Cardano Blockchain Ecosystem Interim Constitution states \"A special form of governance action exists to allow community sentiment to be gauged without committing to any on-chain change. \"Info\" actions have no on-chain effect other than recording the votes on the action.\"\n\nIt may therefore be reasonable to assume that for any “Info” governance actions that are meant to gauge the sentiment towards another type of governance action which CAN be enacted on-chain, an assessment of the constitutionality of that future governance action would be beneficial to the purpose of the \"Info\" governance action being used to assess it.\n### Constitutional Committee Assessment Criteria\nGiven the above considerations, we are able to perform a simple test to determine whether the Constitutional Committee is empowered to assess the constitutionality of a governance action.  The test can be performed by determining the answers to the following two questions:\n1. Is the governance action an \"Info\" action?\n2. Does the \"Info\" action gauge the sentiment for a future governance action that can be enacted on-chain?\n\nTo meet the criteria for the Constitutional Committee to be eligible to assess a governance action's constitutionality, either the answer to Question 1 must be \"No\" OR if the answer to Question 1 is \"Yes\", then the answer to Question 2 must also be \"Yes\".\n\nFor the governance action with ID \"15f82a365bdee483a4b03873a40d3829cc88c048ff3703e11bd01dd9e035c916#0\" and Title \"Name the next hard fork HOSKY Hard Fork\", the answer to Question 1 is \"Yes\", however the answer to Question 2 is \"No\".  This governance action therefore does not meet the constitutionality assessment criteria, so we must **Abstain**.\n### Other Comments\nIn addition to the above test based on the Cardano Blockchain Ecosystem Interim Constitution, there has been some opinion within the Eastern Cardano Council that attempting to assess the constitutionality of activities that are entirely off-chain and therefore not enforceable by any means relevant to the Cardano governance process, is a slippery slope toward imposing conditions on how community members can \"use, participate in and benefit from the Cardano Blockchain\" (Article II, Section 1).",
    "precedentDiscussion": "None",
    "counterargumentDiscussion": "We recognise that abstaining from \"Info\" actions that are not assessing a future governance action which can be enacted on-chain, may be contrary to what is mentioned in the section of CIP-1694 titled \"The versatility of the info governance action\".  This section gives examples of decisions that could be made using the \"Info\" action, which are not enforceable on-chain and do not assess future governance actions that are enforceable on-chain.  The examples given are \"ratifying a CIP\" and \"deciding on the genesis file for a new ledger era\".\n\nWhile we acknowledge that this goes some way to showing intent in the original governance design for \"Info\" actions, where there is a contradiction we are required to defer to the Constitution when making decisions.  If the community believes that there is a need to permit the use of \"Info\" actions to support off-chain governance, then the next version of the Constitution should be modified to reflect this.\n\nIt is however important to consider that doing so for seemingly rational decision making (such as ratifying a CIP), may open the door for potentially frivolous off-chain governance requests to be made through an \"Info\" action.",
    "conclusion": "We abstain from assessing the constitutionality of this governance action as it is not enforceable.",
    "internalVote": {
      "constitutional": 0,
      "unconstitutional": 0,
      "abstain": 6,
      "didNotVote": 0
    },
    "references": [
      {
        "@type": "relevantArticles",
        "label": "Article IV Section 1",
        "uri": "https://constitution.gov.tools/en/interim-constitution#section-1-4"
      },
      {
        "@type": "relevantArticles",
        "label": "Article III Section 5",
        "uri": "https://constitution.gov.tools/en/interim-constitution#section-5"
      },
      {
        "@type": "Other",
        "label": "The versatility of the info governance action, CIP-1694",
        "uri": "https://github.com/cardano-foundation/CIPs/tree/master/CIP-1694#the-versatility-of-the-info-governance-action"
      }
    ]
  },
  "authors": [
    {
      "name": "Eastern Cardano Council",
      "witness": {
        "witnessAlgorithm": "ed25519",
        "publicKey": "a12e0d6516828fd47afc70e2eccdfa11a4f4c76cb5eca55bdc9349865a70e4fe",
        "signature": "5d6d1835f102f22c44c166573b182606df1966c00550c8fb2187931efb6a7ca1349892bf463d5839266752eb75c460c3662cca1889220b1bfe866ea9c80a1c0c"
      }
    }
  ]
}
