{
  "@context": {
    "@language": "en",
    "CIP100": "https://github.com/cardano-foundation/CIPs/blob/master/CIP-0100/README.md#",
    "CIP108": "https://github.com/cardano-foundation/CIPs/blob/master/CIP-0108/README.md#",
    "intersectSpec": "https://github.com/IntersectMBO/governance-actions/blob/main/schemas/specification.md#",
    "hashAlgorithm": "CIP100:hashAlgorithm",
    "body": {
      "@id": "CIP108:body",
      "@context": {
        "references": {
          "@id": "CIP108:references",
          "@container": "@set",
          "@context": {
            "GovernanceMetadata": "CIP100:GovernanceMetadataReference",
            "Other": "CIP100:OtherReference",
            "label": "CIP100:reference-label",
            "uri": "CIP100:reference-uri",
            "referenceHash": {
              "@id": "CIP108:referenceHash",
              "@context": {
                "hashDigest": "CIP108:hashDigest",
                "hashAlgorithm": "CIP100:hashAlgorithm"
              }
            }
          }
        },
        "title": "CIP108:title",
        "abstract": "CIP108:abstract",
        "motivation": "CIP108:motivation",
        "rationale": "CIP108:rationale",
        "onChain": {
          "@id": "intersectSpec:onChain",
          "@context": {
            "governanceActionType": "intersectSpec:governanceActionType",
            "depositReturnAddress": "intersectSpec:depositReturnAddress",
            "withdrawals": {
              "@id": "intersectSpec:withdrawals",
              "@container": "@set",
              "@context": {
                "withdrawalAddress": "intersectSpec:withdrawalAddress",
                "withdrawalAmount": "intersectSpec:withdrawalAmount"
              }
            }
          }
        }
      }
    },
    "authors": {
      "@id": "CIP100:authors",
      "@container": "@set",
      "@context": {
        "name": "http://xmlns.com/foaf/0.1/name",
        "witness": {
          "@id": "CIP100:witness",
          "@context": {
            "witnessAlgorithm": "CIP100:witnessAlgorithm",
            "publicKey": "CIP100:publicKey",
            "signature": "CIP100:signature"
          }
        }
      }
    }
  },
  "authors": [
    {
      "name": "Intersect",
      "witness": {
        "witnessAlgorithm": "ed25519",
        "publicKey": "05568f86955e65c1a59df5ac1985449b167c3828dccd00b3da9df36a1cf1c743",
        "signature": "dd4c079f2c5230613273152fadfb48dc228b0ad341aed416edef7fa7286a562a3db710422e361ed8ae7d32f638f7cd83a83dee27acec7e201941c6a3643a5b0a"
      }
    }
  ],
  "hashAlgorithm": "blake2b-256",
  "body": {
    "title": "Withdraw ₳11,070,323 for TWEAG's Proposals for multiple core budget project...",
    "abstract": "This treasury withdrawal funds **TWEAG's Proposals for multiple core budget projects for Cardano 2025** which will provide the following services:\n\nA suite of core infrastructure projects aimed at advancing the technical foundations of the Cardano blockchain. These initiatives focus on novel, high-impact developments across key areas of the Cardano stack. In the months ahead, Tweag intends to collaborate closely with qualified suppliers, DReps, and Intersect to further shape the structure and scope of these engagements.\n\nThe proposals presented here represent Tweag's intended contribution to Cardano's continued evolution. We invite other ecosystem participants to submit complementary or competitive proposals, and we are open to exploring collaborative partnerships where aligned. Below is a list of the proposals:\n\n1.  Peras (partial)\n\n2.  Canonical Ledger State\n\n3.  Black box Ledger Conformance Testing\n\n4.  Conformance Testing of Consensus\n\n5.  Plutus Script Re-Executor\n\n6.  Genesis Sync Accelerator\n\n7.  Canonical Block and Transaction Diffusion Codecs\n\n8.  Hoarding Node\n\n9.  Block Cost Investigation\n\n10. Cardano-node-emulator: Maintenance proposal\n\n11. History Expiry\n\nIf implemented, this proposal will deliver transformative technical value to the Cardano ecosystem, accelerating development across critical areas of the network stack. The proposed initiatives---ranging from ledger conformance testing and Plutus re-execution tooling, to Genesis synchronization optimization, history expiry, and the development of a Cardano node emulator---are strategically aligned with Cardano's long-term goals of scalability, performance, and verifiability.\n\nThis Treasury Withdrawal is submitted by Intersect on behalf of the vendor. The following sections; Abstract, Motivation, Rationale and Vendor Profile have been sourced from the approved proposal submitted by the Vendor as part of the Intersect budget process.\n\nThis treasury withdrawal funds one of 39 proposals to give effect to the approved budget info action for ₳275,269,340, administered by Intersect via gov_action1u9x73kwufaxa70lfy59g4ynwyrcsaxdcd0gxzzmh67s9fxq4j8hqqk2phgh. The information provided herein is intended to fulfill the spirit of the constitutional requirement for a treasury withdrawal info action by also providing the details of the proposed solution, alignment to the budget, and amount to be withdrawn from the Cardano Treasury.",
    "motivation": "This proposal aims to solve the following problem:\n\nBacked by Tweag by Modus Create and a consortium of trusted ecosystem contributors, this proposal combines deep technical experience with proven delivery capability. It not only addresses current pain points but lays the groundwork for Cardano's continued success as a scalable, decentralized, and open blockchain platform.\n\nEach project targets a specific technical challenge within the core infrastructure:\n\n- Peras, Canonical Ledger State, and Canonical Block and Transaction Diffusion Codecs improve interoperability, clarity, and consistency across the ecosystem.\n\n- Conformance Testing for Ledger and Consensus, alongside Black Box Ledger Testing, ensures protocol correctness and future-proofing through robust validation frameworks.\n\n- Plutus Script Re-Executor and Block Cost Investigation provide practical tools for performance benchmarking and Plutus optimization, directly benefiting DApp developers and toolmakers.\n\n- The Genesis Sync Accelerator and Hoarding Node address network-level performance bottlenecks, improving bootstrap times and reliability.\n\n- The Cardano-node-emulator and History Expiry initiative contribute to better testing, debugging, and long-term node sustainability.\n\n- Collectively, these projects support developers, researchers, node operators, DReps, and governance actors by reinforcing the reliability, performance, and maintainability of Cardano's core systems.\n\nThe return on investment to the Cardano community is clear:\n\n- Faster network upgrades\n\n- Reduced onboarding friction\n\n- Improved protocol transparency\n\n- Better tooling for smart contract teams\n\n- More resilient and testable infrastructure",
    "rationale": "### Project Solution\n\nA suite of core infrastructure projects aimed at advancing the technical foundations of the Cardano blockchain. These initiatives focus on novel, high-impact developments across key areas of the Cardano stack. In the months ahead, Tweag intends to collaborate closely with qualified suppliers, DReps, and Intersect to further shape the structure and scope of these engagements.\n\n### Vendor Profile\n\nAt Tweag by Modus Create, we offer a unique combination of deep technical expertise and strategic consulting capabilities, with a long-standing commitment to open-source and decentralized systems. EURL Tweag has been in business for over a decade, having started in 2013, and has built a reputation for engineering excellence across critical infrastructure projects.\n\nSince January 2018, we have been continuously engaged with IOG (Input Output Global) on a variety of initiatives within the Cardano ecosystem, including conducting audits and core protocol development. Since May 2021, we have also provided formal audits for the Cardano ecosystem, helping to ensure the reliability and security of mission-critical code.\n\nOur team has played a leading role in the development of Cardano's core infrastructure, including leading the consensus and ledger teams, implementing the Ouroboros Genesis protocol, and contributing to the design of Ouroboros Peras. We have been involved in nearly all aspects of the core Cardano node, giving us a comprehensive understanding of the system's architecture, roadmap, and strategic direction.\n\nBeyond Cardano, we bring deep, practical experience with Haskell, Rust, and a wide range of technologies used in polyglot projects, enabling us to engineer scalable, secure, and high-performance systems across domains.\n\nAs part of Modus Create, a global digital transformation consulting firm, we are backed by a diverse team of strategists, designers, and technologists who help the world's leading brands build digital advantage. Modus Create specializes in strategic consulting, full lifecycle product development, platform modernization, and digital operations and is an official partner of top-tier technology providers such as Atlassian, AWS, and GitHub. This global reach and cross-disciplinary strength provide our clients with unmatched capabilities throughout the full product development lifecycle.\n\nThis proposal reflects our ongoing commitment to advancing Cardano's mission through rigorous engineering, strategic alignment, and high-impact delivery.\n\n### Contract Management\n\nA written off-chain Legal Contract will be created between the Vendor and the Cardano Development Holdings (CDH), as mandated by the constitution, and will be administered by Intersect. This will include details of the project delivery schedule and dispute resolution.\n\n### Project Delivery \n\nAll milestones, acceptance criteria, payment amounts and expected delivery dates will be agreed between the Vendor and Intersect, acting on behalf of the CDH. The vendor will deliver according to the agreed-upon project schedule within the Legal Contract, of which the necessary information will be made public via the budget management platform via transaction metadata.\n\nDefined by the milestones within a Legal Contract, the vendor will submit and attest milestone acceptance to the community, Intersect or 3rd Party Assurer.\n\nProject progress will be monitored via Intersect's delivery assurance function which will be communicated to the community.\n\nAcceptance of the above work is expected to be supported by a 3rd Party Assurer, who will be responsible for reviewing and signing off the work completed at each project milestone against the corresponding milestone deliverables detailed within the Legal Contract. This work is funded from a portion of this treasury withdrawal.\n\n### Budget Management Tooling\n\nTo administrate treasury funds on-chain, Intersect will utilize the treasury management smart contract framework developed by Sundae Labs. The smart contracts have been [extensively tested](https://github.com/SundaeSwap-finance/treasury-contracts/tree/main/offchain/tests) including audits from TxPipe and MLabs. Examples of the usage of these contracts can be seen across mainnet described across Intersect authored [Blog 1](https://www.intersectmbo.org/news/smart-contract-mainnet-demo-a-step-toward-on-chain-treasury-withdrawals), [Blog 2](https://www.intersectmbo.org/news/smart-contract-mainnet-demo-day-two-update) and [Blog 3](https://www.intersectmbo.org/news/smart-contract-mainnet-demo-day-three-update).\n\nFinal mainnet validation test can be seen via the Disburse action within transaction: 0f591dc544ae14102dbb4a74d5311a6acffc1772b163d8b7a9656b9525950b17\n\nWith the confirmed treasury reserve contract address being: stake17xzc8pt7fgf0lc0x7eq6z7z6puhsxmzktna7dluahrj6g6ghh5qjr\n\n#### Specifics\n\nIntersect will utilize a single Treasury Reserve Smart Contract (TRSC), with many Project-Specific Smart Contracts (PSSC), managed by Intersect. Intersect's management consists of three 'admin' and two Intersect 'leadership' roles. An Oversight Committee consisting of five external, independent third-party entities will provide checks and balances on Intersect, and safeguard against errors and unilateral control. The administration of both TRSC and PSSCs will be managed by Intersect, with external oversight on certain actions from the Oversight Committee.\n\nThe Oversight Committee consists of Sundae Labs, Cardano Foundation, Dquadrant, Xerberus and NMKR. Their role is to independently verify key administrative actions using on-chain logic, ensuring accuracy and consistency without exercising discretion over governance decisions.\n\nFor all details on Intersect's configuration please see the **[Smart Contract Guide](https://docs.intersectmbo.org/cardano-facilitation-services/cardano-budget/intersect-administration-services/smart-contracts-as-part-of-our-administration)** on the knowledgebase.\n\nThe high level permissions are as follows:\n\n- TRSC Fund and PSSC Modify\n\n  - Two of the three Intersect admins, two of the five trusted entities and one of the two Intersect leadership sign-off must authorize\n\n- TRSC Disperse\n\n  - Two of three Intersect admins, three of five trusted entities and two of two Intersect leadership sign-off must authorize\n\n- TRSC Pause and Resume\n\n  - Two of three Intersect admins, and one of two Intersect leadership sign-off must authorize\n\n- TRSC Sweep\n\n  - One of three Intersect admins, and one of two Intersect leadership sign-off must authorize\n\n- TRSC Reorganize\n\n  - Two of three Intersect admins and three of five trusted entities must authorize\n\n#### Processes\n\nUpon enactment of this governance action, funding for this project will be directed into the TRSC's stake account. All instances of TRSC and PSSC can not be staked with a SPO and will be delegated to the auto-abstain predefined DRep. From here funds will be withdrawn into a UTxO remaining at the TRSC.\n\nWhen the Legal contract is prepared and the vendor is ready, funding for this project will be transferred using the Fund action to a PSSC. All milestones will be outlined within the metadata.\n\nA dashboard will be available for the community to audit the TRSC or PSSC and track metrics related to this withdrawn ada as well as being immutably verifiable on chain.\n\nThe subsections; Contract Management, Project Delivery, and Budget Management Tooling described above cover the constitutional requirements specified in Article IV section 4 and 5.",
    "references": [
      {
        "@type": "Other",
        "label": "Tweag 2025 Budget Proposal (PDF)",
        "uri": "ipfs://bafybeifyxriekqi6ond6k5c4spgbpgw7ijeecud6spw73lfwjsbuktwbsq"
      },
      {
        "@type": "Other",
        "label": "Project Proposal In Ekklesia",
        "uri": "https://2025budget.intersectmbo.org/ballots/680d1b63565577986442d123/proposals/680d1b63565577986442d24e"
      },
      {
        "@type": "Other",
        "label": "Approved Budget Info Action submitted by Intersect via GovTool",
        "uri": "https://gov.tools/outcomes/governance_actions/e14de8d9dc4f4ddf3fe9250a8a926e20f10e99b86bd0610b77d7a054981591ee#0"
      },
      {
        "@type": "Other",
        "label": "Details of all successful proposals (CSV)",
        "uri": "ipfs://bafybeicwrop4q7xvnyjdd5drumbe56sqtm5lbe2ul3c262zt4hgguzdycm"
      },
      {
        "@type": "Other",
        "label": "Automating Accountability: Cardano's Smart Contract Framework Blog",
        "uri": "ipfs://bafybeihqx4ae72z7suqfnxrpqpqithp43cai7o2uuewnqtezgaoyc3ptyq"
      },
      {
        "@type": "Other",
        "label": "Sundae Labs Budget Management Smart Contracts Github Repository",
        "uri": "https://github.com/SundaeSwap-finance/treasury-contracts"
      },
      {
        "@type": "Other",
        "label": "Budget Management Smart Contracts TxPipe Audit Report",
        "uri": "ipfs://bafybeiccnwejbgj43wo6hrlseckkkmprtoqc5cfuy2hesm6c6yealwho3e"
      },
      {
        "@type": "Other",
        "label": "Budget Management Smart Contracts MLabs Audit Report",
        "uri": "ipfs://bafybeiah5fnjhda5hemj3qvaehc4mre3qllqzw2l7mkdsguytn4ftgafw4"
      }
    ],
    "onChain": {
      "governanceActionType": "treasuryWithdrawals",
      "depositReturnAddress": "stake1uyvjdz9rxsfsmv44rtk75k2rqyqskrga96dgdfrqjvjjpwsefcjnp",
      "withdrawals": [
        {
          "withdrawalAddress": "stake17xzc8pt7fgf0lc0x7eq6z7z6puhsxmzktna7dluahrj6g6ghh5qjr",
          "withdrawalAmount": 11070323000000
        }
      ]
    }
  }
}
