{
  "@context": {
    "@language": "en",
    "CIP100": "https://github.com/cardano-foundation/CIPs/blob/master/CIP-0100/README.md#",
    "CIP108": "https://github.com/cardano-foundation/CIPs/blob/master/CIP-0108/README.md#",
    "hashAlgorithm": "CIP100:hashAlgorithm",
    "body": {
      "@id": "CIP108:body",
      "@context": {
        "references": {
          "@id": "CIP108:references",
          "@container": "@set",
          "@context": {
            "GovernanceMetadata": "CIP100:GovernanceMetadataReference",
            "Other": "CIP100:OtherReference",
            "label": "CIP100:reference-label",
            "uri": "CIP100:reference-uri",
            "referenceHash": {
              "@id": "CIP108:referenceHash",
              "@context": {
                "hashDigest": "CIP108:hashDigest",
                "hashAlgorithm": "CIP100:hashAlgorithm"
              }
            }
          }
        },
        "title": "CIP108:title",
        "abstract": "CIP108:abstract",
        "motivation": "CIP108:motivation",
        "rationale": "CIP108:rationale"
      }
    },
    "authors": {
      "@id": "CIP100:authors",
      "@container": "@set",
      "@context": {
        "name": "http://xmlns.com/foaf/0.1/name",
        "witness": {
          "@id": "CIP100:witness",
          "@context": {
            "witnessAlgorithm": "CIP100:witnessAlgorithm",
            "publicKey": "CIP100:publicKey",
            "signature": "CIP100:signature"
          }
        }
      }
    }
  },
  "authors": [],
  "hashAlgorithm": "blake2b-256",
  "body": {
    "abstract": "The Cardano Constitution requires the establishment of a Net Change Limit, which defines the maximum amount of lovelace that can be withdrawn from the treasury during an outlined period of time. This governance action serves as an opportunity for all governance stakeholders to formally express their positions regarding the proposed Net Change Limit, ensuring transparency, accountability, and alignment across the ecosystem.\n\nThis Net Change Limit facilitates a yearly budget cycle for the Cardano community. The 2025 Net Change Limit will begin at the start of Epoch 532 and continue for 72 epochs, finishing at the conclusion of Epoch 604 in December 2025. The 2025 Net Change Limit will be 350,000,000,000,000 lovelace (350M ada). This is the maximum amount that can be withdrawn from the treasury during this specific period and shall not be exceeded.\n\nThe Net Change Limit will be used when reviewing both budget actions and treasury withdrawal actions to ensure constitutionality as required by Article IV of the Cardano Constitution and the Treasury Withdrawal Guardrails outlined in Appendix I.",
    "motivation": "Prior to the submission of any budget request, a Net Change Limit must be formally agreed upon by delegate representatives (Article IV Section 3 of the Constitution). Failure to establish a Net Change Limit shall render any such budget request unconstitutional and, therefore, inapplicable.\n\nThe 2025 Net Change Limit will be effective for the period specified in this action. To support the ecosystem, a 2026 Net Change Limit will be established based on modeling but will remain separate from this governance action.",
    "rationale": "As agreed with the Cardano Budget Committee, the 2025 Net Change Limit shall begin at the start of Epoch 532 and progress for 72 epochs, concluding in December 2025 at the end of Epoch 604.\n\nThe 2025 Net Change Limit shall be set at 350,000,000,000,000 lovelace (350M ada).\n\nThis figure is derived from our modeling, which projected in October 2024 that the treasury would increase by approximately 351M ada across 2024 (epoch 459-531), including all approved withdrawals (e.g., Catalyst). Based on this analysis, the 2025 Net Change Limit was proposed at 350m ada. From January 5th, 2024, Epoch 459, through December 30th, Epoch 531, the actual total income into the Cardano Treasury was 335,957,093 ada. Since this is within 5% of our proposed number, the 2025 Net Change Limit should stay at 350 million ada.\n\nWe propose that the Net Change Limit be set based on the previous year’s total treasury inflows, creating a direct incentive for projects to enhance utility on the blockchain. This approach ensures that funded initiatives drive greater value across the broader ecosystem. We aim to support sustainable growth and long-term advancements within the Cardano network by fostering innovation, efficiency, and real-world applicability.\n\nThis limit shall be applied in assessing budget actions and treasury withdrawal actions to ensure compliance with Article IV of the Cardano Constitution and the Treasury Withdrawal Guardrails specified in Appendix I.\n\nA vote in favor of this proposal shall indicate agreement with the proposed Net Change Limit, allowing for the submission of budget info actions and treasury withdrawal governance actions. The maximum amount that can be withdrawn from the treasury during this specific period shall not exceed the total sum outlined herein.\n\nDuring the socialization of this Net Change Limit, we received feedback from the community that, since the Net Change Limit controls the total amount that can be withdrawn from the treasury in a specified period, the DRep ratification threshold for the Net Change Limit should be set at 67% of the treasury withdrawal parameter percentage. We neither agree nor disagree; however, we recognize that this Net Change Limit must adhere to the guidance outlined in the Cardano Constitution.\n\nThe provisions set forth in the Cardano Constitution state that the approval of a Net Change Limit requires a threshold of greater than 50% of the active voting DRep stake. Therefore, this Net Change Limit will be considered passed if it is greater than 50+1 lovelace%.",
    "references": [
      {
        "label": "Cardano Constitution",
        "@type": "Other",
        "uri": "ipfs://bafkreiazhhawe7sjwuthcfgl3mmv2swec7sukvclu3oli7qdyz4uhhuvmy"
      },
      {
        "label": "Definitions for the Cardano Constitution",
        "@type": "Other",
        "uri": "ipfs://bafkreiewp5bgrdiesq6ft3qypykgcjhvfgpp4s5o4yrjrvko4wuhi4iecu"
      },
      {
        "label": "HisSim Data Model (CSV)",
        "@type": "Other",
        "uri": "ipfs://bafkreicbaiolimteghbwt54veiuw53nc3eaijudtboif2p6xlsr74myfxy"
      },
      {
        "label": "HisSim Data Model (PDF)",
        "@type": "Other",
        "uri": "ipfs://bafybeihms6haw35awizxa37kuo4qghgmjkldr6lvrcl26mdsk4f6rxdwv4"
      },
      {
        "label": "Data Model Variables (CSV)",
        "@type": "Other",
        "uri": "ipfs://bafkreidru733tfuhbldmpwe47hf7yh3amsoh7rtv6jjru2uzo5t7ptkpka"
      },
      {
        "label": "Data Model Variables (PDF)",
        "@type": "Other",
        "uri": "ipfs://bafkreic7z6n5kxwgr2zzdyxsmvbpav2xqwfplxsey62hfbvurlkz45vdpu"
      },
      {
        "label": "Yearly Projections (CSV)",
        "@type": "Other",
        "uri": "ipfs://bafkreicji6wtv64rkcjcqo6dpd4l4wawblnwhjd25syrvnkit4hlfhhskm"
      },
      {
        "label": "Yearly Projections (PDF)",
        "@type": "Other",
        "uri": "ipfs://bafkreib42tfamm6yd54yvxavy5j7bpp4pnwflj4mjcxak3da5yqwgtp3v4"
      },
      {
        "label": "Basic Model Start and End (CSV)",
        "@type": "Other",
        "uri": "ipfs://bafkreih4ty67ywifjsl4x3quwfun45vy2lrefg4iagmgw5v5r7e6c7tqfy"
      },
      {
        "label": "Basic Model Start and End (PDF)",
        "@type": "Other",
        "uri": "ipfs://bafkreiae4jbtet2dgkza7ossitbyfyaapccq5pfzuytqxque44di6xfkse"
      },
      {
        "label": "Ratification Methodology",
        "@type": "Other",
        "uri": "ipfs://bafkreid73y3piatznscr4g2kvyf2cefmedtpurgcad6nnfhqnvlzkbmuei"
      }
    ],
    "title": "2025 Net Change Limit"
  }
}
