{
  "@context": {
    "@language": "en",
    "CIP100": "https://github.com/cardano-foundation/CIPs/blob/master/CIP-0100/README.md#",
    "CIP136": "https://github.com/cardano-foundation/CIPs/blob/master/CIP-0136/README.md#",
    "hashAlgorithm": "CIP100:hashAlgorithm",
    "body": {
      "@id": "CIP136:body",
      "@context": {
        "references": {
          "@id": "CIP100:references",
          "@container": "@set",
          "@context": {
            "GovernanceMetadata": "CIP100:GovernanceMetadataReference",
            "Other": "CIP100:OtherReference",
            "label": "CIP100:reference-label",
            "uri": "CIP100:reference-uri",
            "RelevantArticles": "CIP136:RelevantArticles"
          }
        },
        "summary": "CIP136:summary",
        "rationaleStatement": "CIP136:rationaleStatement",
        "precedentDiscussion": "CIP136:precedentDiscussion",
        "counterargumentDiscussion": "CIP136:counterargumentDiscussion",
        "conclusion": "CIP136:conclusion",
        "internalVote": {
          "@id": "CIP136:internalVote",
          "@container": "@set",
          "@context": {
            "constitutional": "CIP136:constitutional",
            "unconstitutional": "CIP136:unconstitutional",
            "abstain": "CIP136:abstain",
            "didNotVote": "CIP136:didNotVote"
          }
        }
      }
    },
    "authors": {
      "@id": "CIP100:authors",
      "@container": "@set",
      "@context": {
        "did": "@id",
        "name": "http://xmlns.com/foaf/0.1/name",
        "witness": {
          "@id": "CIP100:witness",
          "@context": {
            "witnessAlgorithm": "CIP100:witnessAlgorithm",
            "publicKey": "CIP100:publicKey",
            "signature": "CIP100:signature"
          }
        }
      }
    }
  },
  "hashAlgorithm": "blake2b-256",
  "body": {
    "summary": "We have determined that this Protocol Parameter Change governance action is unconstitutional.",
    "rationaleStatement": "The specific parameter guardrails under APPENDIX I, Section 2.2 of the Cardano Constitution that require consideration for the governance action with ID \"941502b0aa104c850d197923259444d2b57cab7af18b63143775465aaacc84f5#0\" and title \"Decrease Treasury Tax from 20% to 10%\", are TC-01, TC-02, TC-03, TC-04 and TC-05.\n\nThe value proposed in this governance action meets the criteria in these guardrails.\n\nHowever, APPENDIX I, Section 2.6 of the Cardano Constitution states that \"A specific reversion/recovery plan must be produced for each parameter change. This plan must include: Which parameters need to change and in which ways in order to return to the previous state (or a similar state)\".\n\nA simple interpretation of this requirement could mean that a \"reversion plan\" in this case, only needs to describe reverting the treasuryCut back to its current value.  We however interpreted this requirement to mean that the plan must also consider how to revert any secondary effects of the change, to \"return to the previous state\".\n\nFurther, ARTICLE III, Section 5, Paragraph 3 of the Cardano Constitution states \"\"Hard Fork Initiation\" and \"Protocol Parameter Change\" governance actions shall undergo sufficient technical review and scrutiny as mandated by the Guardrails to ensure that the governance action does not endanger the security, functionality, performance or long-term sustainability of the Cardano Blockchain.\"\n\nOur assessment of the information provided with this governance action, found it did not \"undergo sufficient technical review and scrutiny\" to ensure it does not \"endanger\" the \"long-term sustainability of the Cardano Blockchain.\"\n\nFinally, ARTICLE III, Section 5, Paragraph 1 of the Cardano Constitution states that \"Sufficient rationale shall be provided to justify the requested change to the Cardano Blockchain.\"  While ARTICLE III, Section 5, Paragraph 4 states \"All owners of ada shall have the right to ensure that the process for participating in, submitting and voting on on-chain governance actions is open and transparent and is protected from undue influence and manipulation.\"\n\nIt has been argued that some of the information regarding the change to staking rewards in the rationale for this governance action is inaccurate and therefore potentially misleading.  This may at best contravene the requirement for \"sufficient rationale\" or at worst mean voters are not \"protected from undue influence and manipulation.\"\n\nWe acknowledge and appreciate the intention of this governance action - namely, to validate parameters that were originally set by the founding entities without direct community approval. Now that we have transitioned to a liquid democracy, it is reasonable to revisit these foundational decisions. However, we believe that the above excerpts from the Cardano Constitution are in place to ensure that such revisions are held to the same level of research and rigour that was originally applied when setting these parameters. Governance decisions should not be based on sentiment or ideological preferences regarding taxation but rather be grounded in a thorough, research-driven approach that has been part of the Cardano ecosystem since its inception.\n\nBy way of a split decision we find this governance action **Unconstitutional**.",
    "precedentDiscussion": "None",
    "counterargumentDiscussion": "Cardano is a decentralised ecosystem, where governance is balanced among DReps, SPOs, and the Constitutional Committee (CC). Within this governance structure, the Constitutional Committee consists of a small number of members yet holds the extremely powerful authority of vetoing governance actions.\n\nGiven this context, the Constitutional Committee's authority should be exercised with extreme caution and should only intervene in cases of clear constitutional violations. If the Constitutional Committee were to exercise its power based on arbitrary criteria, it would risk undermining the authority of DReps in on-chain governance and damaging the principles of decentralised governance.\n\nArticle VII, Section 6 states \"When voting that a governance action proposed to be executed on-chain is unconstitutional, the Constitutional Committee collectively, or each member of the Constitutional Committee casting such a vote separately, shall set forth the basis for its decision with reference to specific Articles of this Constitution or provisions of the Cardano Blockchain Guardrails Appendix that are in conflict with a given proposal.\"\n\nThis clearly indicates that a determination of unconstitutionality requires special consideration and must be justified by direct reference to specific constitutional violations.\n\nThe council members who deemed this governance action constitutional, while acknowledging the concerns raised, did not consider the lack of a comprehensive revision plan or a sufficiently thorough review process, significant enough to warrant it unconstitutional.",
    "conclusion": "",
    "internalVote": {
      "constitutional": 2,
      "unconstitutional": 4,
      "abstain": 0,
      "didNotVote": 0
    },
    "references": []
  },
  "authors": [
    {
      "name": "Eastern Cardano Council",
      "witness": {
        "witnessAlgorithm": "ed25519",
        "publicKey": "a12e0d6516828fd47afc70e2eccdfa11a4f4c76cb5eca55bdc9349865a70e4fe",
        "signature": "926cf36f56c77a240b4dbabfe1c499af2f04fb810c12375e808b418f58764829fd7c4262450ec8f299ba2bc10997b89bc1443f7f5317848a60ecc8f5e8aef706"
      }
    }
  ]
}
