{
  "@context": {
    "@context": {
      "@language": "en",
      "CIP100": "https://github.com/cardano-foundation/CIPs/blob/master/CIP-0100/README.md#",
      "CIP108": "https://github.com/cardano-foundation/CIPs/blob/master/CIP-0108/README.md#",
      "intersectSpec": "https://github.com/IntersectMBO/governance-actions/blob/main/schemas/specification.md#",
      "hashAlgorithm": "CIP100:hashAlgorithm",
      "body": {
        "@id": "CIP108:body",
        "@context": {
          "references": {
            "@id": "CIP108:references",
            "@container": "@set",
            "@context": {
              "GovernanceMetadata": "CIP100:GovernanceMetadataReference",
              "Other": "CIP100:OtherReference",
              "label": "CIP100:reference-label",
              "uri": "CIP100:reference-uri",
              "referenceHash": {
                "@id": "CIP108:referenceHash",
                "@context": {
                  "hashDigest": "CIP108:hashDigest",
                  "hashAlgorithm": "CIP100:hashAlgorithm"
                }
              }
            }
          },
          "title": "CIP108:title",
          "abstract": "CIP108:abstract",
          "motivation": "CIP108:motivation",
          "rationale": "CIP108:rationale",
          "onChain": {
            "@id": "intersectSpec:onChain",
            "@context": {
              "governanceActionType": "intersectSpec:governanceActionType",
              "depositReturnAddress": "intersectSpec:depositReturnAddress",
              "withdrawals": {
                "@id": "intersectSpec:withdrawals",
                "@container": "@set",
                "@context": {
                  "withdrawalAddress": "intersectSpec:withdrawalAddress",
                  "withdrawalAmount": "intersectSpec:withdrawalAmount"
                }
              }
            }
          }
        }
      },
      "authors": {
        "@id": "CIP100:authors",
        "@container": "@set",
        "@context": {
          "name": "http://xmlns.com/foaf/0.1/name",
          "witness": {
            "@id": "CIP100:witness",
            "@context": {
              "witnessAlgorithm": "CIP100:witnessAlgorithm",
              "publicKey": "CIP100:publicKey",
              "signature": "CIP100:signature"
            }
          }
        }
      }
    }
  },
  "authors": [
    {
      "name": "Input Output Global",
      "witness": {
        "witnessAlgorithm": "CIP-0008",
        "publicKey": "cd674a98d12e3bc0ea847ea95e354ef91ccb0ab7f7b6c7396f22ea576e263487",
        "signature": "84582aa201276761646472657373581de0e0edfd468983df75e52cc1776e0eba518023cd8f540db616e414716fa166686173686564f458202d925108d9034cb75a931d0a7d636ff104ad55a32846af604bbfa1c08f25b862584038a1b6ff7bea0d023b5a9d2be4ffac992ac43a9b035fa3f4721c7893bf341af8f9c6cbbc80b151ac9d5e8b343e859f0725982e87435144fc8c02eea7b525bf02"
      }
    },
    {
      "name": "Cardano Foundation",
      "witness": {
        "witnessAlgorithm": "CIP-0008",
        "publicKey": "a535adf6786e2f8cd4bb7451e9f5b6368a037b8ed42f35b8446fb8946b7d153d",
        "signature": "845846a201276761646472657373583901acb2792c1cb10724327852ac8d03f870732c5bc8e10c22a8b80991411ef0ec112a3c73539566bde6b6abe41bb79191c1baa69edfcb0581f2a166686173686564f458202d925108d9034cb75a931d0a7d636ff104ad55a32846af604bbfa1c08f25b862584071117208b6c1f4cc5277c7395825e7379aded6e3ff6c3d9eaf395d0cc6639897ed3d8dcc6eab69cc5e497aff877bb2cb13863993b7d3d07aea72410a0e6d200a"
      }
    },
    {
      "name": "EMURGO",
      "witness": {
        "witnessAlgorithm": "CIP-0008",
        "publicKey": "0c7148d760478182ec0722c78483b4c057fa35425b1ef579f6a5ce4e40e3d591",
        "signature": "84582aa201276761646472657373581de1807b90d9b566cfa95e749836edf77bdf09207dc0825561fefbdc3a69a166686173686564f458202d925108d9034cb75a931d0a7d636ff104ad55a32846af604bbfa1c08f25b86258406ade796e2b1525c9c2778fffd1b0ebd530f55347b099f787d786e3abe0fcc2d919e481e18bde323193cbbab44a3e5513adbc03f65889680d8b087e138a80e60e"
      }
    },
    {
      "name": "Intersect",
      "witness": {
        "witnessAlgorithm": "ed25519",
        "publicKey": "05568f86955e65c1a59df5ac1985449b167c3828dccd00b3da9df36a1cf1c743",
        "signature": "cdcc5e5adcc43c19026647091ca9214adee47535f9c905f2282630516e35d8744368b4b95eaa7c97b858bed21292c51afb759a76542cde5e9c95dd2274bc270f"
      }
    }
  ],
  "hashAlgorithm": "blake2b-256",
  "body": {
    "title": "Cardano Critical Integrations Budget",
    "abstract": "This Cardano Critical Integrations Budget Governance Action requests ₳70,000,000 from the Cardano Treasury to establish a strategic integration fund supporting the onboarding of critical infrastructure, including tier-one stablecoins, institutional digital asset custody and wallet infrastructures, on-chain analytics platforms, cross-chain bridges, and pricing oracles to the Cardano ecosystem.\n\nThis infrastructure establishes the foundational layer required to onboard tier-one stablecoins, with the potential to unlock exponential growth in DeFi transaction volume across the ecosystem. It will also help accelerate ecosystem efforts in other key areas such as Real World Assets (RWA) and DePin. This acceleration is expected to play a key role in supporting Cardano’s path to profitability as a layer one in terms of fee generation, ensuring long-term financial sustainability.\n\nThis project is being driven through close collaboration between Input | Output Global, the Cardano Foundation, and EMURGO, together with Midnight Foundation and Intersect, all of whom are actively engaged in negotiations with integration partners. Representatives from all five organizations form the Steering Committee, which is responsible for making key strategic decisions. The founding entities and Intersect also recognize the Midnight Foundation’s contributions to date.\n\nInfrastructure providers and/or protocol collaborations are in a mature stage, and several partners have already provided detailed pricing and delivery timelines. However, for reasons of strategic and commercial confidentiality, together with partner companies’ compliance requirements, the specific infrastructures involved can only be disclosed outside of the Steering Committee after the integration is completed.\n\nThe project will follow a milestone-based funding structure, with budget drawdowns executed from Intersect’s custody and administration only upon submission of signed agreements and the agreed scope of work. The Oversight Committee at Intersect will review drawdown requests to confirm that the amounts and designated recipients align with the executed contracts. Since work is already underway in some of these areas, this proposal envisions an early early budget deployment, and we anticipate this budget being utilized immediately and up to 24-month deployment, depending on withdrawal success, contracting periods, and timely receipt.",
    "motivation": "### **Strategic Need**\n\nCardano has a strong technical and governance foundation, but lacks several critical integrations required for large-scale economic activity and external liquidity integration. The absence of key systems, including stablecoin infrastructures, interoperability frameworks, and institutional-grade pricing oracle networks limits the ecosystem’s capacity to attract external capital, facilitate stable on-chain operations, and support advanced DeFi use cases. Cardano also requires solid institutional digital asset custody and wallet infrastructures, as well as on-chain analytics platforms to ensure user access, ecosystem transparency, and multi-chain liquidity efficiency.\n\n* **Stablecoins**  \n  With data and interoperability in place, Cardano can support the introduction of a tier-one stablecoin, the ecosystem’s primary base currency. A stablecoin provides price stability, predictable liquidity, and access for both institutional and retail users. However, its deployment depends on reliable oracle data and established interoperability channels. As such, stablecoin integration is the final step in the infrastructure rollout sequence and the key enabler for large-scale DeFi adoption and sustained liquidity growth.\n\n* **Institutional Digital Asset Custodies and Wallet Infrastructures**  \n  User access and transaction flow depend on a high-quality wallet infrastructure that supports multi-asset management, seamless dApp interaction, and secure cross-chain functionality. Wallets serve as the primary interface between users and Cardano’s financial systems; therefore, scalable, reliable, and feature-rich wallet solutions are required to support onboarding, institutional usage, and mass-market adoption. Enhanced wallet capabilities also ensure that new infrastructure layers like bridges, analytics, and stablecoins remain accessible and usable for all users.\n\n* **On-chain Analytics Platforms**  \n  A mature financial ecosystem requires transparent, real-time insights into network activity, risk exposure, asset flows, and application performance. Advanced analytics platforms allow developers, institutions, compliance teams, and users to assess liquidity conditions, monitor protocol health, and make informed decisions. Without robust analytics, DeFi operations remain opaque, limiting institutional participation and hindering ecosystem-wide risk management.\n\n* **Cross-Chain Bridges**  \n  Once a reliable data layer is established, the next requirement is enabling liquidity and user movement between Cardano and other ecosystems. Bridge and interoperability infrastructures allow assets to transfer securely across blockchains, opening access to external liquidity pools and new user bases. Without these routes, Cardano remains isolated, constraining inflows of capital, developers, and institutional participants.\n\n* **Pricing Oracle Infrastructures**  \n  Oracles provide the external data required for DeFi & RWA operations, including asset pricing, risk management, and stablecoin collateralization. While current native providers such as Charli3 and Orcfax deliver early coverage, Cardano still lacks a globally recognized, institution-grade pricing oracle provider. This limitation restricts the ability of major stablecoin issuers and financial applications to deploy on Cardano, as their operations require data from trusted pricing oracle networks. Establishing a robust pricing oracle infrastructure is the foundational step in enabling higher-level financial systems.\n\n### **Current Gap & Urgency**:\n\nDespite being a top-10 blockchain by market cap, Cardano’s Total Value Locked (TVL) as of November 25th, 2025 remains around $191.860.000 (Source: Defillama.com), which is still far below comparable ecosystems that maintain several billion dollars in DeFi usage. This gap highlights Cardano’s limited market reach and the absence of the core primitives that other networks treat as standard utilities. Without scaling these key components, Cardano risks falling further behind in attracting dApps, liquidity, institutional partners, and large-scale integrations such as tier-one stablecoins.\n\nCardano’s growth requires robust pricing oracles and interoperability layers to connect on-chain applications to external networks and real-world data. These integrations are capital-intensive and time-sensitive, yet they underpin the viability of all future financial primitives.\n\nThis proposal is being brought forward now because discussions on these topics have progressed substantially, and are ready to move forward with various partners. With the current NCL set to expire on 4 January 2026, it is both timely and prudent to submit this proposal and its associated withdrawal under the present NCL, provided the community approves.\n\nBy establishing a transparent ecosystem integration budget through treasury funding, Cardano can secure these essential components rapidly and fairly.\n\n### **Why Treasury Funding**\n\n* **Ecosystem Criticality**  \n  The Cardano ecosystem needs foundational public infrastructure that every dApp depends on. These components cannot be built or licensed by individual teams; they are shared utilities that must be delivered once, at ecosystem scale, to unlock liquidity, attract developers, and enable institutional use cases.\n\n* **Neutrality & Vendor Independence**  \n  Treasury funding ensures that a broad coalition of Cardano stakeholders will determine which critical integrations are onboarded. This avoids commercial bias, guarantees neutrality, and allows the integrations to be governed transparently under Cardano’s constitutional framework.\n\n* **Governance Alignment & Transparency**  \n  By placing the budget under Intersect administration, all fund flows follow constitutional guardrails: separate auditable addresses, auto-abstain delegation, milestone validation, independent audits, and public reporting. This ensures full community oversight from start to finish and reinforces decentralized governance across the entire integration pipeline.\n\n### **Timeline & Current State of Governance**\n\nThis budget info action and its associated treasury withdrawal governance action will seek to pass prior to the expiry of the current NCL on 4 January 2026. While this is an ambitious timeline, it is believed to be possible with expedient voting from DReps and the CC, and justified on the underlying need for this proposal and motivation expressed above.\n\nThe withdrawal timeline is envisaged as follows:\n\n* 27 November 2025: Submission of this budget info action.  \n* As early as the 4 December 2025: Provided there is sufficient DRep approval at this stage and signs are not overwhelmingly negative, the associated treasury withdrawal will be submitted in parallel to allow DReps to consider the withdrawal and begin voting. This will still be subject to the CC vote and passing of this budget info action.  \n* 8 December 2025: The update CC governance action will be launched (based on current timelines announced by Intersect)  \n* 30 December 2025: This budget info action expires\n* 4 January 2026: Provided that the new CC is appointed; the CC have voted; DReps have approved the budget info action and DReps have cast sufficient votes for the treasury withdrawal - then the treasury withdrawal will pass on the final day of the current NCL.\n\nThe treasury withdrawal will not be deemed constitutional until the budget info action passes on 30 December 2025 (if DReps and CC approve), however, DReps will be able to vote on the actions and express their view from as early as 4 December 2025. CC members may also cast preliminary opinions on constitutionality during the period of voting on the budget info action, and finalise their opinions on the treasury withdrawal between 30 December 2025 and 4 January 2026.\n\nIt is fully acknowledged that there are multiple dependencies to the passing of the treasury withdrawal governance action, however it is technically feasible with sufficient community support, which we hope to receive.\n\n### **Steering Committee**\n\nThe Steering Committee provides high-level business direction and integration governance of this initiative. The committee oversees negotiation strategy, prioritization of integrations, and overall alignment with Cardano’s ecosystem needs. Its purpose is to ensure that each integration delivers clear strategic value and that strategic decisions are made transparently, rationally, and in the best interest of the ecosystem.\n\nThe Steering Committee operates as a five-member group representing Input | Output Global, the Cardano Foundation, EMURGO, Midnight Foundation and Intersect. These members act independently to maintain neutrality. Together, they evaluate which integrations should be onboarded first, assess ecosystem impact, and guide the negotiation of commercial and contracting terms with integration partners. The Steering Committee voting members will not be compensated from withdrawn funds and will each cover their own expenses. An amount of no more than 5% of the budget will be allocated to legal, custodian fees, administration, and compliance costs of the Administrator and connected parties.\n\nThe Steering Committee comprises representatives from each of the following organizations:\n\n* Input | Output Global  \n* Cardano Foundation  \n* EMURGO  \n* Midnight Foundation  \n* Intersect (as a non-voting member acting in the capacity of the Administrator)",
    "rationale": "The Cardano Critical Integrations Budget will use the requested ₳70,000,000 to cover:\n\n**• Integration and other necessary associated costs**  \nCover the integration work and all related expenses, including deployment development, licensing fees, maintenance costs, and any additional infrastructure required to support the integrations.\n\n**• Legal and Audit**  \nCover due diligence, legal, insurance, and compliance requirements, and periodic independent audits to satisfy the requirements of the Cardano Constitution.\n\n**• Contingency Reserve**  \nMaintain a reserve to accommodate scope adjustments or market shifts, while preserving delivery certainty and financial discipline.\n\n**• Admin Fees**  \nCover custody fees, minting fees of stablecoins, and any other administrative costs that may arise during setup and execution of the Cardano Critical Integrations Budget\n\n₳ 70,000,000 refers to the remaining funds available within the current NCL. A high-level budget breakdown is planned to be included in the subsequent Treasury Withdrawal Governance Action following this Budget Info Action. However, due to confidentiality obligations applied by most integration partners, the breakdown will be limited in granularity. If the allocated budget is not used at the end of the 24-month period, all remaining funds will be returned to the Cardano Treasury.\n\n### **Administration of Funds**\n\nAll treasury funds will be administered by Intersect as an Administrator under Cardano’s constitutional framework. All treasury funds for this initiative will be administered by Intersect under Article IV of the Constitution. Intersect acts as the administrator for the entire budget. Contracting for integrations will be assigned on the principle of budget compatibility and “most likely to succeed”, i.e. to any entity that has the required skills and availability. This Budget Info Action is submitted by Intersect with support and the collaboration of the Cardano Foundation, Input Output Global, and EMURGO as co-proposers.\n\n#### Steering Committee Authority\n\nThe Steering Committee will negotiate commercial terms with integration partners and will include a technical assessment of feasibility and implementation requirements.\n\nAllocations from this budget will be approved by the Steering Committee. The quorum for any budget allocation to an integration will be 3/4 of all Steering Committee members. Once an integration is approved, Intersect will administer and execute the associated disbursements to the contracting entity, as defined for each integration.\n\nThe Steering Committee will publish progress reports upon achieving integration milestones\n\n## **Role of Intersect and Contractual Counterparties**\n\nIntersect will receive the funds and administer this budget. If this Budget Info Action and the subsequent Treasury Withdrawal are approved, funds will be received into the Treasury Reserve Smart Contract framework administered by Intersect with checks and balances from the independent smart contract Oversight Committee made up of five members; the Cardano Foundation, NMKR, Xerberus, SundaeLabs and Dquadrant. Funds from there will be disbursed transparently according to the contracting arrangements. Disbursements will be made directly from the smart contract framework or an institutional-grade custodian to vendors, as selected by the Steering Committee. It is currently not envisioned that the smart contract framework deployed earlier this year will be fully utilized, as this will likely result in disclosure of integration costs, which are typically confidential and protected by non-disclosure agreements. Intersect and the co-proposers will endeavor to negotiate integration contracts that allow for as much public disclosure as reasonably possible and the Steering Committee will disclose such information in their progress reports.\n\nCo-proposers or other entities chosen by the Steering Committee from time to time may, if required, act as the contracting counterparty with an integration partner. When this occurs, Intersect and the Cardano Development Holdings will enter into a contract with the designated entity defining the scope, obligations, reporting requirements, and drawdown conditions. Under this arrangement, the designated entity receives disbursements from related smart contract/s or custodians as determined by the contract terms.\n\nIntersect will only act as a contracting counterparty when it has completed its own due diligence and satisfied its Delivery Assurance standards. If Intersect declines to act as counterparty for a specific integration, another designated entity may do so, provided that a contract is established between that designated entity, Intersect and the for the purpose of receiving budget disbursements.\n\n## **Payment Execution and Safeguards**\n\nDisbursements will be executed through either smart contracts or institutional-grade custodians. These disbursements will follow the Statements of Work and the commercial terms approved by the Steering Committee.\n\n## **Unused funds and program conclusion**\n\nIf at the end of the 24 months period the budget has not been fully utilized, all remaining funds will be returned to the Cardano Treasury. A final reconciliation and summary will be included in the oversight reporting by Intersect, in collaboration with the Steering Committee.\n\n### **Cardano Addresses**\n\nTreasury funds will be received and held by Intersect, acting as the Constitutional Administrator, in addresses or accounts designated exclusively for this proposal and auditable by the community.\n\nTo fulfil constitutional requirements, these addresses will be delegated to the Auto-Abstain DRep and will not be staked to any Stake Pool Operator (SPO), ensuring that the funds do not influence governance or generate staking rewards. It is currently not envisioned that smart contracts will be fully used by Intersect to disbursement funds, to protect the confidentiality of vendor pricing. However, they will be used where possible and Intersect will be able to ensure oversight and transparency through the independent audit and access to information.\n\nThrough this arrangement, Intersect maintains full custody transparency, enabling verifiable auditing and milestone tracking under Cardano’s constitutional governance framework, satisfying Articles IV(2), (4) & (5) in particular.\n\n### **Goals & Metrics**\n\n| Category | Target | Verification Source |\n| ----- | ----- | ----- |\n| Stablecoin | A tier-one stablecoin is targeted for deployment on Cardano mainnet as the integrations progress. | The integration is live on Cardano Mainnet. |\n| Institutional digital asset custody and wallet infrastructure | The program aims to support the deployment of a tier-one stablecoin on Cardano mainnet as delivery progresses. | The integration is live on Cardano Mainnet. |\n| On-chain analytics platform | Tier-one analytics platform targeted for mainnet. | The integration is live on Cardano Mainnet. |\n| Cross-chain bridge | A tier-one cross-chain bridge is planned for mainnet deployment as integration work with selected partners is finalised. | The integration is live on Cardano Mainnet. |\n| Pricing oracle | Tier-one pricing oracle targeted for mainnet. | The integration is live on Cardano Mainnet. |\n| Transparency compliance | Completed milestones reported through the Intersect channel. | Intersect reports. |\n| Audit completion | Annual independent audit conducted and published, following Intersect’s current financial reporting framework for Tier 3 full assurance. | Intersect reports. |\n\n### **Acceptance Criteria and Milestone-Based Disbursement**\n\nThe acceptance criteria will vary between vendors, but will be made public once commercial terms and contracting has been agreed between the vendor, Intersect and the Steering Committee. It is expected a “milestone zero” payment will cover the essential setup costs of this initiative, which may include converting ada into a stablecoin, stablecoin minting fees, and custody fees. Converted assets will be held in a regulated custodian. Legal costs for onboarding integration partners are also included in this early operational budget.\n\nIn general, integration partners will receive funds only after verified delivery of agreed technical and operational milestones. That said, payment structures may vary deal to deal. Where a partner requires funds in advance to commence delivery, an upfront payment may be made at the point of contract signature. Any such upfront disbursement or “milestone zero” payment will be explicitly defined in the agreement and tied to a clear scope and deliverables.\n\nIntegrations requiring ongoing support may receive additional approved maintenance payments during the program period.\n\nThis disbursement structure ensures efficient execution, transparent financial management, and strict alignment with Cardano’s governance requirements.\n\n### **Reporting**\n\nIntersect and the Steering Committee will publish a bi-annual report covering:\n\n1. **Financial Summary & Treasury Reconciliation** – total funds disbursed, remaining, and audited.  \n2. **Project Progress & Milestone Review** – integration status and outcomes.  \n3. **Audit & Compliance Statement** – summary of independent audit findings.  \n4. **Ecosystem Impact Assessment** – measurable effects on Cardano adoption and interoperability.  \n5. **Governance & Future Outlook** – proposed next steps or renewal recommendations.\n\n## Constitutionality Checklist\n\n### **Article III.5**\n\n✔️ This proposal is prepared in a standardized and legible format and will include a URL and hash of all off-chain materials at submission. It provides a clear title, abstract, rationale, motivation, and supporting information in accordance with this article.\n\n### **Article IV.1**\n\n✔️This proposal fits the purpose of Article IV.1 as it supports the maintenance, operation, and future development of the Cardano ecosystem through critical integrations.\n\n### **Article IV.2**\n\n✔️This proposal specifies Intersect as the administrator and outlines transparent reporting, an oversight structure and explains where the processes are or are not administered via smart contracts (where it is not possible or beneficial). These elements meet the constitutional requirement for the use of administrators and on-chain tools where beneficial.\n\n### **Article IV.4**\n\n✔️This proposal allocates a budget for independent audits and includes clear oversight metrics & mechanisms such as contractual milestone-based verification, bi-yearly reporting, dispute resolution provisions (to be included in relevant legal contracts), and a defined Steering Committee. These elements satisfy the constitutional requirements for audits and oversight metrics.\n\n## **Conclusion**\n\nThe Cardano Critical Integrations Budget is a decisive step toward addressing one of Cardano’s most pressing issues: the lack of mature oracle and interoperability integrations, alongside other core integrations required for large scale DeFi and attracting external liquidity. With these foundational integrations in place, and with tier-one stablecoin onboarding, Cardano can finally overcome the barriers that have historically prevented developers, institutions, and liquidity from other leading blockchains from entering Cardano.\n\nThis proposal unlocks the power of decentralized governance and transforms weakness into strength by allocating ₳70,000,000 in constitutionally governed, milestone-based funding. This funding supports the full rollout sequence of ecosystem critical integrations, including institutional digital asset custody and wallet infrastructures, tier one on-chain analytics platforms, cross-chain bridges, and globally recognized pricing oracles, all of which together provide the essential data, liquidity pathways, user access, and stablecoin rails on which every thriving DeFi network relies.\n\nTransparently administered by Intersect under Cardano’s governance framework and guided by an experienced Steering Committee, The Cardano Critical Integrations Budget ensures verifiable outcomes and measurable ecosystem value through clear contracting, milestone verification, and independent audits. It is a catalyst that demonstrates how decentralized governance can responsibly allocate capital while accelerating the delivery of critical integrations that will ensure Cardano’s long-term competitiveness and sustainability.",
    "references": [
      {
        "@type": "Other",
        "label": "Cardano Constitution",
        "uri": "ipfs://bafkreiazhhawe7sjwuthcfgl3mmv2swec7sukvclu3oli7qdyz4uhhuvmy"
      },
      {
        "@type": "Other",
        "label": "Definitions for the Cardano Constitution",
        "uri": "ipfs://bafkreiewp5bgrdiesq6ft3qypykgcjhvfgpp4s5o4yrjrvko4wuhi4iecu"
      }
    ],
    "onChain": {
      "governanceActionType": "info",
      "depositReturnAddress": "stake1uxq8hyxek4nvl227wjvrdm0h000sjgraczp92c07l0wr56g05k4la"
    }
  }
}
