{
  "@context": {
    "@language": "en-us",
    "CIP100": "https://github.com/cardano-foundation/CIPs/blob/master/CIP-0100/README.md#",
    "CIP108": "https://github.com/cardano-foundation/CIPs/blob/master/CIP-0108/README.md#",
    "hashAlgorithm": "CIP100:hashAlgorithm",
    "body": {
      "@id": "CIP108:body",
      "@context": {
        "references": {
          "@id": "CIP108:references",
          "@container": "@set",
          "@context": {
            "GovernanceMetadata": "CIP100:GovernanceMetadataReference",
            "Other": "CIP100:OtherReference",
            "label": "CIP100:reference-label",
            "uri": "CIP100:reference-uri",
            "referenceHash": {
              "@id": "CIP108:referenceHash",
              "@context": {
                "hashDigest": "CIP108:hashDigest",
                "hashAlgorithm": "CIP100:hashAlgorithm"
              }
            }
          }
        },
        "comment": "CIP100:comment",
        "externalUpdates": {
          "@id": "CIP100:externalUpdates",
          "@context": {
            "title": "CIP100:update-title",
            "uri": "CIP100:update-uri"
          }
        },
        "title": "CIP108:title",
        "abstract": "CIP108:abstract",
        "motivation": "CIP108:motivation",
        "rationale": "CIP108:rationale"
      }
    },
    "authors": {
      "@id": "CIP100:authors",
      "@container": "@set",
      "@context": {
        "name": "http://xmlns.com/foaf/0.1/name",
        "witness": {
          "@id": "CIP100:witness",
          "@context": {
            "witnessAlgorithm": "CIP100:witnessAlgorithm",
            "publicKey": "CIP100:publicKey",
            "signature": "CIP100:signature"
          }
        }
      }
    }
  },
  "hashAlgorithm": "blake2b-256",
  "body": {
    "title": "Defining the Cardano Vision and Roadmap for 2025 and beyond",
    "abstract": "This Info Action calls for a vote by Cardano Delegate Representatives (DReps) on the proposed future roadmap for Cardano. This roadmap, developed by the Cardano Product Committee of Intersect with consultation from key technical stakeholders, outlines key development priorities, technological advancements, and strategic goals for the Cardano ecosystem. The DRep vote will provide crucial input for strategic alignment and inform future budget proposals, including the current budget conversations.",
    "motivation": "The long-term success and adoption of the Cardano blockchain depend on a clear and community-backed roadmap. DReps play a vital role in shaping Cardano's future. This vote empowers DReps to exercise their governance rights and directly influence the development trajectory of Cardano, reflecting the collective will of their constituents through liquid democracy. A well-defined roadmap, endorsed by DReps, ensures that development efforts are focused and aligned with the shared vision for Cardano, maximizing the impact of development resources and fostering a cohesive ecosystem. This roadmap will also inform the budget proposals developed by Intersect.\n\nDuring the lifetime of the governance action, the Product Committee will iterate upon the roadmap based upon DRep feedback, adjusting the referenced roadmap. DReps are encouraged to attach metadata to their votes, providing rationale; these rationales will be reviewed by the Product Committee. A *yes* vote for this action signals support for the proposed roadmap. A *no* vote on this action signals a lack of support for the roadmap. An *abstain* vote means signals neither in favor nor against. While the referenced roadmap develops, DReps should consider submitting multiple votes to signal approval across versions.",
    "rationale": "This vote is important for gathering community consensus on the vision and roadmap priorities for Cardano in 2025. While the focus is on near-term deliverables which add real value, we envisage some of the items outlined in the roadmap to be a multi-year endeavor, so it is important to provide the broader context. By participating, DReps can ensure that the development trajectory of Cardano reflects the collective will of their constituents. A clear and community-backed roadmap is essential for aligning development efforts with the shared vision for Cardano's future, maximizing the impact of resources, and fostering a cohesive ecosystem. This process promotes transparency and ensures accountability in shaping the future of the Cardano blockchain.",
    "references": [
      {
        "@type": "Other",
        "label": "Product Vision and Roadmap for 2025",
        "uri": "https://product.cardano.intersectmbo.org/vision-roadmap-2025"
      }
    ]
  },
  "authors": [
    {
      "name": "Samuel Leathers (Intersect Product Committee Chair)",
      "witness": {
        "witnessAlgorithm": "ed25519",
        "publicKey": "7f42934d3195440f9cc1ac5814ddb70b5da585f9bb2b077edf72694cd03e6a0b",
        "signature": "44c15a95775d16f5d0c9cc5b7b0b1b5661ce42f0b8288228db8f9e71c7d66dcd92854b3ad3ad7eb61c3103e173ec3026d2d07174db471fee33161721add0d70c"
      }
    }
  ]
}
