{
  "@context": {
    "@language": "en",
    "CIP100": "https://github.com/cardano-foundation/CIPs/blob/master/CIP-0100/README.md#",
    "CIP136": "https://github.com/cardano-foundation/CIPs/blob/master/CIP-0136/README.md#",
    "hashAlgorithm": "CIP100:hashAlgorithm",
    "body": {
      "@id": "CIP136:body",
      "@context": {
        "references": {
          "@id": "CIP100:references",
          "@container": "@set",
          "@context": {
            "GovernanceMetadata": "CIP100:GovernanceMetadataReference",
            "Other": "CIP100:OtherReference",
            "label": "CIP100:reference-label",
            "uri": "CIP100:reference-uri",
            "RelevantArticles": "CIP136:RelevantArticles"
          }
        },
        "summary": "CIP136:summary",
        "rationaleStatement": "CIP136:rationaleStatement",
        "precedentDiscussion": "CIP136:precedentDiscussion",
        "counterargumentDiscussion": "CIP136:counterargumentDiscussion",
        "conclusion": "CIP136:conclusion",
        "internalVote": {
          "@id": "CIP136:internalVote",
          "@container": "@set",
          "@context": {
            "constitutional": "CIP136:constitutional",
            "unconstitutional": "CIP136:unconstitutional",
            "abstain": "CIP136:abstain",
            "didNotVote": "CIP136:didNotVote"
          }
        }
      }
    },
    "authors": {
      "@id": "CIP100:authors",
      "@container": "@set",
      "@context": {
        "did": "@id",
        "name": "http://xmlns.com/foaf/0.1/name",
        "witness": {
          "@id": "CIP100:witness",
          "@context": {
            "witnessAlgorithm": "CIP100:witnessAlgorithm",
            "publicKey": "CIP100:publicKey",
            "signature": "CIP100:signature"
          }
        }
      }
    }
  },
  "hashAlgorithm": "blake2b-256",
  "body": {
    "summary": "We have determined that this Info action does not meet the criteria deemed necessary for the Constitutional Committee to assess its constitutionality.",
    "rationaleStatement": "Article VII, Section 1 of the Cardano Constitution states \"The Constitutional Committee shall comprise a set of owners of ada that is collectively responsible for ensuring that on-chain governance actions prior to enactment on-chain, are constitutional.\"\n\nAdditionally; Article VII, Section 4, Paragraph 2 states \"Because \"Info\" actions have no on-chain effect and, accordingly, are neither constitutional nor unconstitutional, Constitutional Committee members may not prevent “Info” actions from being recorded on-chain. Members of the Constitutional Committee may nevertheless record a vote on-chain regarding an \"Info\" action in order to express their view on such \"Info\" action, including whether the suggested course of action proposed in such \"Info\" action, would be, in the view of such member, unconstitutional if it were to be enforced by on-chain mechanisms.\"\n\nFinally; Article VII, Section 4, Paragraph 3 states \"In the case of \"Info\" actions that propose a Cardano Blockchain ecosystem budget, Constitutional Committee members shall record a vote on-chain that sets forth their opinion as to whether the proposed budget, if it were to be implemented in the form contained in the \"Info\" action, would violate this Constitution.\"\n\nThe governance action with ID \"637e3c256da9c1350847ca3211e8c44e3660a4471e8b6f68a8c537746b4aeb73#0\" and title \"Set a 300 million ADA Net Change Limit for Epochs 563–635\", as an Info governance action, does not relate to a budget proposal, nor does it gauge sentiment towards another type of governance action which could be enacted on-chain, so the Constitutional Committee is not empowered to assess its constitutionality, ensuring DReps and SPOs are the only ones able to influence its outcome.\n\nWe therefore **Abstain**.",
    "precedentDiscussion": "None",
    "counterargumentDiscussion": "While the Cardano Constitution allows (as described in the above sections) the Constitutional Committee to remove themselves from influencing the outcome of Info governance actions, the approval of a Net Change Limit (NCL) Info governance action sets a value which future Treasury Withdrawal governance actions may be dependent upon.\n\nTherefore, if there is any ambiguity regarding the constitutionality of the NCL Info governance action, Treasury Withdrawal governance actions could fail to be enacted on a \"technicality\".  While the Cardano Constitution doesn’t provide any guidance towards how an Info governance action should be considered if the Constitutional Committee unanimously abstained from voting, an explicit opinion about its constitutionality may help to avoid any uncertainty.\n\nThe Eastern Cardano Council recommends that a future change to how the NCL is defined be considered, to remove this potential issue.  Such a change could be done either in the Cardano Constitution, by mandating the NCL Info governance action be voted on by the Constitutional Committee, or by making the NCL a protocol parameter instead of an Info governance action.",
    "conclusion": "We abstain from assessing the constitutionality of this governance action.",
    "internalVote": {
      "constitutional": 1,
      "unconstitutional": 0,
      "abstain": 5,
      "didNotVote": 0
    },
    "references": []
  },
  "authors": [
    {
      "name": "Eastern Cardano Council",
      "witness": {
        "witnessAlgorithm": "ed25519",
        "publicKey": "a12e0d6516828fd47afc70e2eccdfa11a4f4c76cb5eca55bdc9349865a70e4fe",
        "signature": "4ab74c86c8280e4e3f3c6a309c83b537b576da7a6aeb307883b7f5f8a48493e3db1c0b9d28932255c9c89dbe88eeb0f67ff7863da9a45ba946769dd23c2c670a"
      }
    }
  ]
}
