{
  "@context": {
    "@language": "en-us",
    "CIP100": "https://github.com/cardano-foundation/CIPs/blob/master/CIP-0100/README.md#",
    "CIP136": "https://github.com/cardano-foundation/CIPs/blob/master/CIP-0136/README.md#",
    "hashAlgorithm": "CIP100:hashAlgorithm",
    "body": {
      "@id": "CIP136:body",
      "@context": {
        "references": {
          "@id": "CIP100:references",
          "@container": "@set",
          "@context": {
            "GovernanceMetadata": "CIP100:GovernanceMetadataReference",
            "Other": "CIP100:OtherReference",
            "label": "CIP100:reference-label",
            "uri": "CIP100:reference-uri",
            "RelevantArticles": "CIP136:RelevantArticles"
          }
        },
        "summary": "CIP136:summary",
        "rationaleStatement": "CIP136:rationaleStatement",
        "precedentDiscussion": "CIP136:precedentDiscussion",
        "counterargumentDiscussion": "CIP136:counterargumentDiscussion",
        "conclusion": "CIP136:conclusion",
        "internalVote": {
          "@id": "CIP136:internalVote",
          "@container": "@set",
          "@context": {
            "constitutional": "CIP136:constitutional",
            "unconstitutional": "CIP136:unconstitutional",
            "abstain": "CIP136:abstain",
            "didNotVote": "CIP136:didNotVote",
            "againstVote": "CIP136:againstVote"
          }
        }
      }
    },
    "authors": {
      "@id": "CIP100:authors",
      "@container": "@set",
      "@context": {
        "did": "@id",
        "name": "http://xmlns.com/foaf/0.1/name",
        "witness": {
          "@id": "CIP100:witness",
          "@context": {
            "witnessAlgorithm": "CIP100:witnessAlgorithm",
            "publicKey": "CIP100:publicKey",
            "signature": "CIP100:signature"
          }
        }
      }
    }
  },
  "hashAlgorithm": "blake2b-256",
  "body": {
    "govActionId": "gov_action16tdkp3fs0j6303e4utgp8rftdug0ckezr4sslgv8wxdaeq40ngpsq5sr06h",
    "summary": "Tingvard judge the “Withdraw ₳1,150,000 for GovTool 12 months active maintenance and development” treasury withdrawal governance action constitutional.",
    "rationaleStatement": "This governance action is properly framed as a treasury withdrawal under Article IV. It requests ₳1,150,000 to fund 12 months of maintenance and development for GovTool, Cardano’s open-source, community-owned governance tooling platform. The withdrawal follows the budget Info action gov_action1n5sn54mgf47a7men2ryq6ppx88kta4wvenz2qkl4f9v6ppje8easqxwm88m, which approved the associated budget, satisfying the constitutional requirement to align withdrawal actions with an approved budget plan (Article IV, § 1).\nThe action satisfies the requirements of Article IV, § 2, which governs administration of treasury funds. Administration of the funds will be handled by Intersect through a treasury management smart contract framework developed by Sundae Labs and audited by TxPipe and MLabs. Funds will be held in a Treasury Reserve Smart Contract (TRSC) and disbursed to Project-Specific Smart Contracts (PSSCs) as milestones are met. An Oversight Committee of five independent entities is established to verify key administrative actions on-chain. The Oversight Committee’s limited powers and on-chain verification mechanisms align with the principle of ensuring funds are administered with constitutional accountability.\nThe action also satisfies Article IV, § 4, which requires measures to ensure transparency and auditability of treasury usage. Milestones, acceptance criteria, and payment schedules are defined, with delivery verification conducted by Intersect or a third-party assurer before disbursement. A public dashboard (cardanotreasury.fi) will allow the community to audit fund flows, track milestones, and verify spending immutably on-chain. The inclusion of delivery assurance processes and third-party verification provides the transparency and accountability required by the Constitution.\nArticle IV, § 5 requires treasury funds not to be delegated to a stake pool operator (SPO) and, where delegated, to use the predefined auto-abstain DRep. The proposal explicitly states that the TRSC and PSSCs cannot delegate to SPOs and will delegate only to the auto-abstain predefined DRep. This satisfies the non-delegation and delegation requirements of Article IV, § 5.\nThe action further aligns with the constitutional principles outlined in Article II. It supports the sustainability of Cardano’s governance infrastructure (Tenet 9), enhances decentralisation by providing open-source governance tools accessible to all participants, and upholds transparency and community oversight by making all code public and establishing reporting and verification mechanisms.",
    "precedentDiscussion": "This decision affirms the constitutional principle that treasury withdrawal actions must directly align with an approved budget Info action (Article IV, § 1), include clear administrative and oversight structures (Article IV, § 2), and provide mechanisms for transparency and auditability (Article IV, § 4). It also confirms that delegation and custody requirements (Article IV, § 5) apply equally to treasury reserve and project-specific contracts.\nThe use of milestone-based disbursement, third-party assurance, and a public auditing interface demonstrates a governance approach consistent with constitutional expectations. The inclusion of these elements strengthens Cardano’s governance framework by illustrating how large-scale treasury disbursements can remain transparent, accountable, and compliant.",
    "counterargumentDiscussion": "A minor point of confusion arises from the Project Solution section, where the listed allocations appear to sum to an amount exceeding ₳1.15 million over the twelve-month period. However, as the treasury withdrawal explicitly specifies a total request of ₳1.15 million — an amount identical to that approved in the referenced budget Info action — Tingvard considers this a discrepancy in presentation rather than substance. The apparent mismatch likely reflects the use of approximate or rounded figures within the breakdown rather than an intent to alter the approved total. Accordingly, Tingvard finds this aspect confusing but not unconstitutional.",
    "conclusion": "Tingvard finds this treasury withdrawal governance action constitutional. It conforms to Article IV, § 1–5 and aligns with the Cardano Blockchain Tenets of sustainability, transparency, and decentralisation. The governance design ensures that treasury funds are administered with appropriate oversight, disbursed according to verified milestones, safeguarded under the delegation rules, and transparently auditable by the community.",
    "internalVote": {
      "constitutional": 6,
      "unconstitutional": 0,
      "abstain": 0,
      "didNotVote": 0,
      "againstVote": 0
    },
    "references": [
      {
        "@type": "Other",
        "label": "Cardano Blockchain Ecosystem Constitution",
        "uri": "ipfs://bafkreiazhhawe7sjwuthcfgl3mmv2swec7sukvclu3oli7qdyz4uhhuvmy"
      }
    ]
  },
  "authors": [
    {
      "name": "Tingvard"
    }
  ]
}
