{
  "@context": {
    "@language": "en-us",
    "CIP100": "https://github.com/cardano-foundation/CIPs/blob/master/CIP-0100/README.md#",
    "CIP136": "https://github.com/cardano-foundation/CIPs/blob/master/CIP-0136/README.md#",
    "hashAlgorithm": "CIP100:hashAlgorithm",
    "body": {
      "@id": "CIP136:body",
      "@context": {
        "references": {
          "@id": "CIP100:references",
          "@container": "@set",
          "@context": {
            "GovernanceMetadata": "CIP100:GovernanceMetadataReference",
            "Other": "CIP100:OtherReference",
            "label": "CIP100:reference-label",
            "uri": "CIP100:reference-uri",
            "RelevantArticles": "CIP136:RelevantArticles"
          }
        },
        "summary": "CIP136:summary",
        "rationaleStatement": "CIP136:rationaleStatement",
        "precedentDiscussion": "CIP136:precedentDiscussion",
        "counterargumentDiscussion": "CIP136:counterargumentDiscussion",
        "conclusion": "CIP136:conclusion",
        "internalVote": {
          "@id": "CIP136:internalVote",
          "@container": "@set",
          "@context": {
            "constitutional": "CIP136:constitutional",
            "unconstitutional": "CIP136:unconstitutional",
            "abstain": "CIP136:abstain",
            "didNotVote": "CIP136:didNotVote"
          }
        }
      }
    },
    "authors": {
      "@id": "CIP100:authors",
      "@container": "@set",
      "@context": {
        "did": "@id",
        "name": "http://xmlns.com/foaf/0.1/name",
        "witness": {
          "@id": "CIP100:witness",
          "@context": {
            "witnessAlgorithm": "CIP100:witnessAlgorithm",
            "publicKey": "CIP100:publicKey",
            "signature": "CIP100:signature"
          }
        }
      }
    }
  },
  "hashAlgorithm": "blake2b-256",
  "body": {
    "govActionId": "gov_action16tdkp3fs0j6303e4utgp8rftdug0ckezr4sslgv8wxdaeq40ngpsq5sr06h",
    "summary": "Ace Alliance finds the proposed “Withdraw ₳1,150,000 for GovTool 12 months active maintenance and development” Governance Action **Constitutional**.",
    "rationaleStatement": "A [PDF version][pdf-link] of this rationale is also made available.\n\n[pdf-link]: https://ipfs.io/ipfs/QmXLbqYGZfG7HcKbVBTWN2mEdXtiAcyaeCg1Ny7AdoLY26\n\nThis Treasury Withdrawal Governance Action (gov\\_action16tdkp3fs0j6303e4utgp8rftdug0ckezr4sslgv8wxdaeq40ngpsq5sr06h) seeks to withdrawal 1,150,000 ada from the Cardano Treasury for 12 months of GovTool maintenance and development.\n\nArticle III, Section 5 indicates “...all proposed governance actions are expected to follow a standardized and legible format including a URL and hash of all documented off-chain content to the Cardano Blockchain. Sufficient rationale shall be provided to justify the requested change to the Cardano Blockchain. The rationale shall include, at a minimum, a title, abstract, reason for the proposal, and relevant supporting materials. The content of every on-chain governance action must be identical to the final off-chain version of the proposed action.” This proposed Treasury Withdrawal Governance Action meets these expectations. \n\nArticle IV, Section 3, Sentence 1 provides “Withdrawals from the Cardano Blockchain treasury that would cause the Cardano Blockchain treasury balance to violate the then applicable net change limit shall not be permitted.” This proposal, if enacted, would not violate the in-effect net change limit (gov\\_action1nd3t833j7v5sz65k3tp9yyvztw60sjcjgcgjr37682s3m7frwrusqmd2k80). \n\nArticle IV, Section 3, Sentence 2 provides “No withdrawals from the Cardano Blockchain treasury shall be permitted unless such withdrawals have been authorized and are being made pursuant to a budget for the Cardano Blockchain that is then in effect as required by the Cardano Blockchain Guardrails Appendix, and which has not been determined by the Constitutional Committee to be unconstitutional.” This Treasury Withdrawal Governance Action is submitted pursuant to the approved “Cardano GovTool Budget \\- 12 months full active maintenance and development” Budget Info Action (gov\\_action1n5sn54mgf47a7men2ryq6ppx88kta4wvenz2qkl4f9v6ppje8easqxwm88m).\n\nArticle IV, Section 4, Sentence 1 provides “Any governance action requesting ada from the Cardano Blockchain treasury shall require an allocation of ada as a part of such funding request to cover the cost of periodic independent audits and the implementation of oversight metrics as to the use of such ada.” In our assessment of governance action constitutionality, we consider information included in the proposed governance action and the linked, immutable content it incorporates. \n\nHere, the immutable proposed Treasury Withdrawal Governance Action rationale links to and incorporates the corresponding immutable Budget Info Action (gov\\_action1n5sn54mgf47a7men2ryq6ppx88kta4wvenz2qkl4f9v6ppje8easqxwm88m) in the Abstract and Supporting Links sections. Accordingly, we consider this information in assessing constitutionality under Article IV, Section 4, Sentence 1\\. \n\nUnder the Constitutionality Checklist section of that Budget Info Action, and citing the relevant authority, it states “This proposal, if approved, intends to use part of the ₳100k committed by Intersect to cover cost of periodic independent audits.” Because we consider this linked, immutable information in our assessment, the only remaining question as to constitutionality on this point is whether this satisfies Article IV, Section 4, Sentence 1 by constituting “an allocation of ada as a part of such funding request.” \n\nWe find that it does satisfy this requirement for two reasons. \n\nFirst, this constitutes an allocation of ada — it allocates ₳100k in the possession of the Administrator for this purpose — and that allocation is a part of such funding request, the Treasury Withdrawal Governance Action and incorporated Budget Info Action. The Constitution does not require, for example, “an allocation of ada as a part of such \\*funding received\\*,” or “an allocation of ada \\*from\\* such requested funds.” Here, the text of the incorporated Budget Info Action constitutes an allocation of ₳100k as a part of such funding request. \n\nSecond, finding an action unconstitutional for proactively allocating Administrator-held ada to cover these costs conflicts with the objective purpose of the requirement — this proposal’s provision for the cost of audit and oversight is more restrictive than what the Constitution requires, not less.   \n\nArticle IV, Section 4, Sentence 2 provides “Contractual obligations governing the use of ada received from the Cardano Blockchain treasury pursuant to a Cardano Blockchain ecosystem budget shall include dispute resolution provisions.” The proposal indicates Intersect-facilitated legal contracts will be entered into which include dispute resolution processes. \n\nArticle IV, Section 5 requires “Any ada received from a Cardano Blockchain treasury withdrawal, so long as such ada is being held directly or indirectly by an administrator prior to further disbursement, must be kept in one or more separate accounts that can be audited by the Cardano Community, and such accounts shall not be delegated to an SPO but must be delegated to the predefined auto abstain voting option.” This proposal fulfills the constitutional requirement, as Intersect’s Treasury Reserve Smart Contract (TRSC) is the designated recipient of the requested funds, and the provided stake credential is not delegated to a stake pool and delegated to the auto-abstain pre-defined voting option.",
    "precedentDiscussion": "In this decision we specify: \n\n1.) In our assessment of governance action constitutionality, we consider information included in the proposed governance action and the linked, immutable content it incorporates. While we find the specific facts underpinning this Treasury Withdrawal Governance Action did not violate Article IV, Section 4, Sentence 1, we strongly advise future drafters of Treasury Withdrawal Governance Action to directly provide for Article IV, Section 4, Sentence 1 compliance instead of relying on Budget Info Action incorporation.\n\n2.) In our assessment of Article IV, Section 4, Sentence 1, we decline to narrowly interpret “...an allocation of ada as a part of such funding request…” in a manner counter to its objective purpose — to ensure that ada is allocated for the cost of periodic independent audits and the implementation of oversight metrics. Here, the Treasury Withdrawal Governance Action’s allocation of ada for this purpose is currently held by the Administrator, Intersect. While finding the action unconstitutional on this basis would be counter to the provision’s purpose under these specific facts, that same analysis for other facts presented in a future Treasury Withdrawal Governance Action could result in the opposite conclusion. Accordingly, we strongly advise that future Treasury Withdrawal Governance Action drafters specify an allocation of ada from the amount to be disbursed following successful action enactment to mitigate the other possible outcome of this fact-dependent analysis.",
    "counterargumentDiscussion": "We decline to find this Treasury Withdrawal Governance Action unconstitutional on the basis of Article IV, Section 4, Sentence 1, for the reasons provided in the above Rationale Statement and Precedent Discussion sections.",
    "conclusion": "Ace Alliance finds the proposed “Withdraw ₳1,150,000 for GovTool 12 months active maintenance and development” Governance Action **Constitutional**.",
    "internalVote": {
      "constitutional": 4,
      "unconstitutional": 0,
      "abstain": 1,
      "didNotVote": 0,
      "againstVote": 0
    },
    "references": [
      {
        "@type": "RelevantArticles",
        "label": "Cardano Constitution (IPFS)",
        "uri": "ipfs://bafkreiazhhawe7sjwuthcfgl3mmv2swec7sukvclu3oli7qdyz4uhhuvmy"
      },
      {
        "@type": "GovernanceMetadata",
        "label": "Metadata Anchor URL (IPFS",
        "uri": "ipfs://bafkreihju7a6zywpv3adaeeg4nnyrkewurng5csavsspmqsgikzg2suhry"
      },
      {
        "@type": "GovernanceMetadata",
        "label": "Metadata Anchor Hash",
        "uri": "e2ed7354990674f1087cb3672f0418ed2dde4f7cad3190992cea0448d5ca5bc9"
      },
      {
        "@type": "GovernanceMetadata",
        "label": "Approved Budget Info Action (IPFS)",
        "uri": "ipfs://bafybeiambzcwdncmvmzymjfmbr2x4saxul7rffgvtpbd2rtebeb34xxry4"
      },
      {
        "@type": "Other",
        "label": "Rationale PDF",
        "uri": "ipfs://QmXLbqYGZfG7HcKbVBTWN2mEdXtiAcyaeCg1Ny7AdoLY26"
      }
    ]
  },
  "authors": [
    {
      "name": "Ace Alliance"
    }
  ]
}
