{
  "@context": {
    "@language": "en-us",
    "CIP100": "https://github.com/cardano-foundation/CIPs/blob/master/CIP-0100/README.md#",
    "CIP136": "https://github.com/cardano-foundation/CIPs/blob/master/CIP-0136/README.md#",
    "hashAlgorithm": "CIP100:hashAlgorithm",
    "body": {
      "@id": "CIP136:body",
      "@context": {
        "references": {
          "@id": "CIP100:references",
          "@container": "@set",
          "@context": {
            "GovernanceMetadata": "CIP100:GovernanceMetadataReference",
            "Other": "CIP100:OtherReference",
            "label": "CIP100:reference-label",
            "uri": "CIP100:reference-uri",
            "RelevantArticles": "CIP136:RelevantArticles"
          }
        },
        "summary": "CIP136:summary",
        "rationaleStatement": "CIP136:rationaleStatement",
        "precedentDiscussion": "CIP136:precedentDiscussion",
        "counterargumentDiscussion": "CIP136:counterargumentDiscussion",
        "conclusion": "CIP136:conclusion",
        "internalVote": {
          "@id": "CIP136:internalVote",
          "@container": "@set",
          "@context": {
            "constitutional": "CIP136:constitutional",
            "unconstitutional": "CIP136:unconstitutional",
            "abstain": "CIP136:abstain",
            "didNotVote": "CIP136:didNotVote",
            "againstVote": "CIP136:againstVote"
          }
        }
      }
    },
    "authors": {
      "@id": "CIP100:authors",
      "@container": "@set",
      "@context": {
        "did": "@id",
        "name": "http://xmlns.com/foaf/0.1/name",
        "witness": {
          "@id": "CIP100:witness",
          "@context": {
            "witnessAlgorithm": "CIP100:witnessAlgorithm",
            "publicKey": "CIP100:publicKey",
            "signature": "CIP100:signature"
          }
        }
      }
    }
  },
  "hashAlgorithm": "blake2b-256",
  "body": {
    "govActionId": "gov_action1jr84r96lnsvu9yd6c0jhxe9gj5r7vnd2pgkntc6klplxdpyzz4tqqc9uldx",
    "summary": "Tingvard judge the Snek Foundation’s 5M ada loan-based budget Info action constitutional.",
    "rationaleStatement": "This proposal is properly framed as a budget Info action under Articles III.4 and IV.1. It presents a clear rationale, specifies duration and scope, and provides a structured plan with oversight mechanisms. The proposal identifies Intersect as the administrator (Article IV.2), reserves funds for independent audits (Article IV.4), and ensures custody practices in line with Article IV.5. The requested amount, while large, is declared to be within the current Net-Change Limit (Article IV.3). Reporting, milestone audits, and dispute resolution mechanisms are specified. As an Info action, it does not yet enact treasury withdrawals but establishes a constitutional budget framework for later withdrawals.",
    "precedentDiscussion": "This proposal is notable in seeking to introduce a loan-based budget model rather than the more common grant-based approach. The Constitution is silent on whether treasury allocations must be grants, and Article IV.1 explicitly permits flexibility in structuring budgets, so long as oversight, transparency, and sustainability are preserved. By affirming its constitutionality, Tingvard acknowledges that loan models are constitutionally permissible so long as they meet Articles IV.2–IV.5. This sets a precedent that innovative financial structures can be considered constitutional, provided they embed accountability and safeguard treasury resources.",
    "counterargumentDiscussion": "One counterargument is that the Constitution did not anticipate the Treasury acting as a lending institution. However, Article IV frames treasury use broadly as funding for ecosystem operation, maintenance, and development, without limiting the form of financial arrangement. The repayment requirement arguably enhances sustainability, aligning with Tenet 9 (fairness and long-term viability). Another counterargument concerns the scale of the request (5M ada) and its concentration on a single project. Article IV.3 provides protection through the Net-Change Limit, and as the proposer asserts this limit is not exceeded, the proposal remains constitutional. It is also argued that reliance on a single token project could be seen as preferential treatment. Tenet 9 requires impartiality, but impartiality does not mean uniform distribution of funds; it requires decisions to be judged against long-term sustainability, which this proposal seeks to advance by creating reusable infrastructure for Cardano-native tokens.",
    "conclusion": "For these reasons, Tingvard finds the governance action constitutional. It conforms to Articles III.4, III.5, and IV.1–5, while aligning with the Tenets of decentralisation, sustainability, and transparency. The use of a loan structure represents an evolution in budget design that remains consistent with the Constitution’s flexibility. We therefore affirm its constitutional validity as a budget Info action.",
    "internalVote": {
      "constitutional": 6,
      "unconstitutional": 0,
      "abstain": 0,
      "didNotVote": 0,
      "againstVote": 0
    },
    "references": [
      {
        "@type": "Other",
        "label": "Cardano Blockchain Ecosystem Constitution",
        "uri": "ipfs://bafkreiazhhawe7sjwuthcfgl3mmv2swec7sukvclu3oli7qdyz4uhhuvmy"
      }
    ]
  },
  "authors": [
    {
      "name": "Tingvard"
    }
  ]
}
