{
  "@context": {
    "@context": {
      "@language": "en",
      "CIP100": "https://github.com/cardano-foundation/CIPs/blob/master/CIP-0100/README.md#",
      "CIP108": "https://github.com/cardano-foundation/CIPs/blob/master/CIP-0108/README.md#",
      "intersectSpec": "https://github.com/IntersectMBO/governance-actions/blob/main/schemas/specification.md#",
      "hashAlgorithm": "CIP100:hashAlgorithm",
      "body": {
        "@id": "CIP108:body",
        "@context": {
          "references": {
            "@id": "CIP108:references",
            "@container": "@set",
            "@context": {
              "GovernanceMetadata": "CIP100:GovernanceMetadataReference",
              "Other": "CIP100:OtherReference",
              "label": "CIP100:reference-label",
              "uri": "CIP100:reference-uri",
              "referenceHash": {
                "@id": "CIP108:referenceHash",
                "@context": {
                  "hashDigest": "CIP108:hashDigest",
                  "hashAlgorithm": "CIP100:hashAlgorithm"
                }
              }
            }
          },
          "title": "CIP108:title",
          "abstract": "CIP108:abstract",
          "motivation": "CIP108:motivation",
          "rationale": "CIP108:rationale",
          "onChain": {
            "@id": "intersectSpec:onChain",
            "@context": {
              "governanceActionType": "intersectSpec:governanceActionType",
              "depositReturnAddress": "intersectSpec:depositReturnAddress",
              "withdrawals": {
                "@id": "intersectSpec:withdrawals",
                "@container": "@set",
                "@context": {
                  "withdrawalAddress": "intersectSpec:withdrawalAddress",
                  "withdrawalAmount": "intersectSpec:withdrawalAmount"
                }
              }
            }
          }
        }
      },
      "authors": {
        "@id": "CIP100:authors",
        "@container": "@set",
        "@context": {
          "name": "http://xmlns.com/foaf/0.1/name",
          "witness": {
            "@id": "CIP100:witness",
            "@context": {
              "witnessAlgorithm": "CIP100:witnessAlgorithm",
              "publicKey": "CIP100:publicKey",
              "signature": "CIP100:signature"
            }
          }
        }
      }
    }
  },
  "authors": [
    {
      "name": "Intersect",
      "witness": {
        "witnessAlgorithm": "ed25519",
        "publicKey": "05568f86955e65c1a59df5ac1985449b167c3828dccd00b3da9df36a1cf1c743",
        "signature": "859d6020892c37e38578e724e7163b1759826f908bdfc98e561b63ce7dd49fce54c9b0677fe1e6d93e5b0699cda1db1c8ac07ca134cac44c060cd0e8cf7f6600"
      }
    }
  ],
  "hashAlgorithm": "blake2b-256",
  "body": {
    "title": "Cardano 2030: Vision, Mission, Strategy Framework and KPIs",
    "abstract": "Starting at the end of 2024 and continuing throughout 2025, the Cardano Product Committee of Intersect facilitated the **first community-led process to propose a 2030 Cardano Vision and Strategy**. During the first part of 2025 this process also received delegated authority and funding by Cardano DReps during the 2025 budget cycle.\n\nThe extensive process the Product Committee followed, which **involved 700+ people**, focused on collecting as much input as possible from the broader community with attention to representative groups via different channels such as surveys, focus groups and remote and in-person workshops, and then reconnecting with those same groups to review a draft proposal based on the input provided. This process can be reused in the future to keep both Vision and Strategy updated ([high level process mapped](https://productcommittee.docs.intersectmbo.org/committee-outcomes/2030-long-term-cardano-vision)):\n\n1. [Input collection - Workshops](https://productcommittee.docs.intersectmbo.org/committee-outcomes/2030-long-term-cardano-vision/insights-collected/insights-collection-workshops)  \n2. [Focus group SPOs](https://productcommittee.docs.intersectmbo.org/committee-outcomes/2030-long-term-cardano-vision/insights-collected/focus-groups)  \n3. [Surveys](https://productcommittee.docs.intersectmbo.org/committee-outcomes/2030-long-term-cardano-vision/insights-collected/surveys)  \n4. Conversations with founding entities leaders from IOG, Cardano Foundation, EMURGO  \n5. [Business calls](https://product.cardano.intersectmbo.org/business-interviews/)  \n6. [Drafted proposal](https://product.cardano.intersectmbo.org/vision/)  \n7. [Reviewed proposal Workshops](https://productcommittee.docs.intersectmbo.org/committee-outcomes/2030-long-term-cardano-vision/draft-review-workshops)  \n   * [Proposal link and history on github](https://github.com/IntersectMBO/product-website/commits/master)  \n8. [Approved budget withdrawal on 17th August](https://gov.tools/outcomes/governance_actions/8ad3d454f3496a35cb0d07b0fd32f687f66338b7d60e787fc0a22939e5d8833e#35)",
    "motivation": "### Why a Defined Vision Matters Now More Than Ever\n\nIn the rapidly evolving blockchain landscape, a clear and articulated vision is no longer a luxury, but a necessity. For Cardano, establishing a forward-looking Vision 2030 is crucial to ensure sustained growth, focused innovation, and broad legitimacy.\n\n* **Infra-first limits:** Technical robustness alone does not attract developers or users; without direction, ecosystems fragment and stagnate.  \n* **Clarifying Cardano’s purpose:** Cardano must clearly articulate why it exists and what unique problems it solves to stand out among capable competitors.  \n* **Strategy beyond features:** Past roadmaps focused on *how* to build, not *why*. A vision ties technical progress to real-world users, markets, and outcomes  \n* **Measuring stick:** An established Strategy with KPIs gives DReps a measuring stick they can use to evaluate proposals against.\n\n### The Risks of Operating Without a Unified Vision\n\nLack of a shared long-term vision exposes Cardano to major strategic risks:\n\n* **Misallocation of resources:** Talent, treasury, and community energy scatter across low-impact efforts.  \n* **Hijacked narratives:** Hype cycles and trends can unintentionally steer the ecosystem without intentional Strategy.  \n* **Loss of differentiation:** Without clear strengths, Cardano becomes interchangeable with other L1s.  \n* **Outpaced by focused rivals:** Competitors that target specific niches with clear intent can outperform broad, unfocused ecosystems.\n\n### The Strategic Investment in Clarity\n\nBuilding a strong vision requires deliberate choices—and trade-offs:\n\n* **Prioritization means exclusion:** A meaningful vision must guide DReps to choose who and what Cardano serves best.  \n* **Focus requires trade-offs:** Differentiation makes Cardano highly suited for some use cases and less for others.  \n* **Alignment requires discipline:** Saying “no” to initiatives that don’t support the vision strengthens execution and coherence.\n\n### Conclusion\n\nA shared, well-defined vision is foundational to Cardano’s next decade. It guides development, reduces strategic risk, optimizes resource use, and unifies the ecosystem around meaningful, measurable impact. This first version of Cardano 2030 proposal is essential to ensuring Cardano’s continued relevance, differentiation, and long-term leadership.",
    "rationale": "To make the first community-led process to define Cardano’s vision for 2030 and a Strategy to get there, the Product Committee followed an extensive repeatable open process, and got further legitimacy by the delegated authority the approved budget gave.\n\nNow that we are in full governance and the Cardano community is fully leading Cardano we aim to share a common direction to channel our common effort. The proposed vision and Strategy are aiming to offer that.\n\nAll the elements of this proposal, Vision, Mission, Strategy framework and KPIs, are not intended to remain fixed forever, but rather be **a starting point** to constantly review as new data become available and improve to remain relevant. The process followed to reach this point is documented and repeatable, but any other comparable process supported by data and community consultation will provide a strong foundation for future updates via info actions.\n\n### Vision Breakdown\n\n*Cardano is the most secure, reliable and censorship-resistant blockchain for mission critical applications to power economies and societies of the future.*\n\n“*Most secure, reliable and censorship-resistant*” refers to the current qualities Cardano has achieved through its infrastructure, 99% uptime and decentralized structure.  \n“*For mission critical applications*” refers to those applications (AKA potential clients) that would require “*secure, reliable and censorship-resistant*” infrastructure for their use cases. “*To power economies and societies of the future*” refers to the broader goal these applications (clients) have.\n\n### Mission Breakdown\n\n*To empower a global ecosystem of builders, businesses, organizations, governments and communities by providing a scalable, secure, and research-based platform that enables the creation of transparent and fair digital economies.*\n\n*“To empower a global ecosystem of builders, businesses, organizations, governments and communities”*  refers to the foundational layer we provide and who are the key groups that we see will benefit from it*. “by providing a scalable, secure, and research-based platform that enables the creation of transparent and fair digital economies.”* connects to the offering covered in the vision.\n\n### Strategy Framework overview\n\nRead the full Strategy Framework [here](https://product.cardano.intersectmbo.org/vision/strategy-2030)\n\n* **Pillar 1**: Infrastructure & Research Excellence  \n  Keep Cardano secure, fast, and interoperable so it can host more economic activity.  \n* **Pillar 2**: Adoption & Utility  \n  Driving widespread, non-speculative utility by focusing on high-value industry verticals, superior user experience (UX), and enterprise-grade security.  \n* **Pillar 3**: Governance  \n  Cardano governance must be hard to capture, easy to use, and paced. This builds directly on Cardano’s tripartite model of DReps, Constitutional Committee, and SPOs.  \n* **Pillar 4**: Community & Ecosystem Growth  \n  Driving global engagement through a market-centric approach, cultivating a skilled developer base, and proactively demonstrating ecosystem value.  \n* **Pillar 5**: Ecosystem Sustainability & Resilience  \n  Ensuring the long-term financial health and operational integrity of the network infrastructure.\n\nThe **current proposed KPIs** aim to cover the minimum high level required to both track progress and to show ecosystem status externally. As the Product Committee, as well as other community members in the ecosystem, collect more data we will submit the following info actions to refine and incorporate these. (See full proposed KPIs [here](https://product.cardano.intersectmbo.org/vision/strategy-2030#core-key-performance-indicators-kpis))\n\n### Constitutionality checklist\n\nThis proposal does not require per se Constitutional Committee approval. However, as it is intended to support what is already expressed in the Cardano Constitution and, if approved, to provide a shared direction for the broader community, we encourage and welcome the current Constitutional Committee to review and, if they see fit, support this info action.\n\n### Why you should support this proposal\n\nSupporting the Cardano 2030 Vision and Strategy is essential because it provides **DReps** with a crucial **strategic measuring stick** for effective governance and treasury resource allocation. This document, which includes five Strategic Pillars and associated KPIs, gives DReps a community-vetted filter to rigorously evaluate funding requests and initiatives. It enables them to ask: *Does this proposal advance Cardano toward its 2030 Vision of being the most secure, reliable, and censorship-resistant blockchain for mission-critical applications?* **Crucially, this framework is designed to inform voting, not enforce it.** The Vision is a strategic document, not a constitutional one; it provides a shared direction to channel collective effort, but it **does not compel DReps to vote in a specific manner** and **has no bearing on the constitutionality of any future proposal or action**. By adopting this vision, the community gains the strategic discipline to focus resources and accelerate coherent, long-term growth.\n\nWe invite DReps and SPOs to attach metadata with rationale and feedback to their votes on this action.",
    "references": [
      {
        "@type": "Other",
        "label": "Vision and Mission (PDF)",
        "uri": "ipfs://bafkreicu4r3rowukvtrxaok3xd7bxkoig6uxmxgldjpyt6shjli5vjwhxe"
      },
      {
        "@type": "Other",
        "label": "Vision and Mission (Markdown)",
        "uri": "ipfs://bafkreigvrlerhlh5a3ushxoldp4rplhek2ew2hk5qih6gymozmsxybqgce"
      },
      {
        "@type": "Other",
        "label": "Strategy Framework and KPIs (PDF)",
        "uri": "ipfs://bafkreiewgqs6c25nk7gtzlf5udrqumpiqnbxhix7tu4yvssr2lgxgs3k2m"
      },
      {
        "@type": "Other",
        "label": "Strategy Framework and KPIs (Markdown)",
        "uri": "ipfs://bafkreiaodc3h2wcvzwputnpsl5yildfgj7jc776aomkkjaiedeqrvqifxm"
      },
      {
        "@type": "Other",
        "label": "Live version of Vision and Mission",
        "uri": "https://product.cardano.intersectmbo.org/vision/vision-2030"
      },
      {
        "@type": "Other",
        "label": "Live version of Strategy Framework and KPIs",
        "uri": "https://product.cardano.intersectmbo.org/vision/strategy-2030"
      },
      {
        "@type": "Other",
        "label": "Translations for this action",
        "uri": "https://productcommittee.docs.intersectmbo.org/committee-outcomes/2030-long-term-cardano-vision/cardano-2030-info-action/cardano-2030-info-action-translations"
      }
    ],
    "onChain": {
      "governanceActionType": "info",
      "depositReturnAddress": "stake1uyvjdz9rxsfsmv44rtk75k2rqyqskrga96dgdfrqjvjjpwsefcjnp"
    }
  }
}
