{
  "@context": {
    "@language": "en-us",
    "CIP100": "https://github.com/cardano-foundation/CIPs/blob/master/CIP-0100/README.md#",
    "CIP136": "https://github.com/cardano-foundation/CIPs/blob/master/CIP-0136/README.md#",
    "hashAlgorithm": "CIP100:hashAlgorithm",
    "body": {
      "@id": "CIP136:body",
      "@context": {
        "references": {
          "@id": "CIP100:references",
          "@container": "@set",
          "@context": {
            "GovernanceMetadata": "CIP100:GovernanceMetadataReference",
            "Other": "CIP100:OtherReference",
            "label": "CIP100:reference-label",
            "uri": "CIP100:reference-uri",
            "RelevantArticles": "CIP136:RelevantArticles"
          }
        },
        "summary": "CIP136:summary",
        "rationaleStatement": "CIP136:rationaleStatement",
        "precedentDiscussion": "CIP136:precedentDiscussion",
        "counterargumentDiscussion": "CIP136:counterargumentDiscussion",
        "conclusion": "CIP136:conclusion",
        "internalVote": {
          "@id": "CIP136:internalVote",
          "@container": "@set",
          "@context": {
            "constitutional": "CIP136:constitutional",
            "unconstitutional": "CIP136:unconstitutional",
            "abstain": "CIP136:abstain",
            "didNotVote": "CIP136:didNotVote"
          }
        }
      }
    },
    "authors": {
      "@id": "CIP100:authors",
      "@container": "@set",
      "@context": {
        "did": "@id",
        "name": "http://xmlns.com/foaf/0.1/name",
        "witness": {
          "@id": "CIP100:witness",
          "@context": {
            "witnessAlgorithm": "CIP100:witnessAlgorithm",
            "publicKey": "CIP100:publicKey",
            "signature": "CIP100:signature"
          }
        }
      }
    }
  },
  "hashAlgorithm": "blake2b-256",
  "body": {
    "govActionId": "gov_action1jxne7hynfd7frcczwumd2eggps4kvy0msjztz9t0mutpy870ksgqqp6vp3p",
    "summary": "Ace Alliance finds the proposed “Cardano Blockchain Ecosystem Constitution v2.4” New Constitution Governance Action Constitutional.",
    "rationaleStatement": "A [PDF version][pdf-link] of this rationale is also made available.\n\n[pdf-link]: https://ipfs.io/ipfs/QmZfbu5MmFYDWuSJ8kT9dXqfHewuZZqNKGumAo6Q2XQVUc\n\nThe proposed Cardano Blockchain Ecosystem Constitution v2.4 complies with the amendment requirements of Article VIII. It satisfies the documentation standards of Article III, Section 5, by providing immutable IPFS references, indicating differences from previous versions, and including supporting rationale.\n\nThis governance action seeks to reinforce the existing balance of powers between DReps, SPOs, and the Constitutional Committee without altering the framework established in the current Constitution. \n\nWe found the previous version of this action (gov\\_action1ezp0r9rgf4njx93p9uq7l3kjs9m739jm0ntf26vplcmucec4jc0qqxjlfrc) Constitutional on the above grounds, assess this Action on the same grounds, and reach the same conclusion.",
    "precedentDiscussion": "We reference and reiterate our Precedent Discussion from the previous version of this New Constitutional Governance Action: \n\n“According to Article VII, Section 1, the Constitutional Committee must assess the constitutionality of all Governance Actions, including New Constitution actions. Questions have been raised as to whether the Constitutional Committee should evaluate procedural, but not substantive aspects of New Constitution actions, citing the possibility that this body could block the collective will of ada holders.\n\nCardano is governed through a constitutional system where the values and requirements delineated in the Constitution are the foundational expression of the will of ada holders, immutably recorded on the blockchain. However, if the Constitutional Committee should block a New Constitution, the DReps selected by ada holders may pass an Update Committee action to replace members of the Constitutional Committee with new members who interpret the constitution in line with their current collective will.\n\nThis system enforces checks and balances between the governance bodies, where the eagerness of DReps to adopt a Constitution with new rules and possibly new values is tempered by the Constitutional Committee’s duty to evaluate such actions. When reviewing this or any future New Constitution action, we must determine whether we are willing to risk our tenure on the Constitutional Committee in order to stand for the position that it is unconstitutional.”",
    "counterargumentDiscussion": "As considered in our Counterargument Discussion from the previous version of this New Constitutional Governance Action, ”some may raise concerns that updates to the Guardrails Appendix could alter treasury or network behavior in conflict with the written text of the Constitution.” Here, just as assessed for the prior Action version, “Independent review confirms that none of the amended guardrails are enforced by the on-chain Guardrails Script. The change maintains both constitutional and operational continuity.”",
    "conclusion": "We find this “Cardano Blockchain Ecosystem Constitution v2.4” New Constitution Governance Action Constitutional. The Action meets relevant procedural requirements and provides a consistent text for community consideration.",
    "internalVote": {
      "constitutional": 5,
      "unconstitutional": 0,
      "abstain": 0,
      "didNotVote": 0,
      "againstVote": 0
    },
    "references": [
      {
        "@type": "RelevantArticles",
        "label": "Cardano Constitution (IPFS)",
        "uri": "ipfs://bafkreigxpweqv2rnh7ajt5hzdq6gikogmaq3nbyof5uvdntc4hkg52ghqy"
      },
      {
        "@type": "GovernanceMetadata",
        "label": "Metadata Anchor URL (IPFS)",
        "uri": "ipfs://bafkreigxpweqv2rnh7ajt5hzdq6gikogmaq3nbyof5uvdntc4hkg52ghqy"
      },
      {
        "@type": "GovernanceMetadata",
        "label": "Metadata Anchor Hash",
        "uri": "6c5645b67cca1f39323984f97ea2d5f5a68423c592407e241b0637e26d244591"
      },
      {
        "@type": "Other",
        "label": "List of changes from v1.0 to v2.4.pdf",
        "uri": "ipfs://bafybeihsv7crutk4xrwut5p5fdvgeum45hioazn2dldnqk2ljiv7sp3oda"
      },
      {
        "@type": "Other",
        "label": "List of changes from v2.3 to v2.4.pdf",
        "uri": "ipfs://bafybeibu2v7l6z3k5jhhdtzv74fcrlaedxwdwtxu2ogwudykyfjjfreppu"
      },
      {
        "@type": "Other",
        "label": "Rationale PDF",
        "uri": "ipfs://QmZfbu5MmFYDWuSJ8kT9dXqfHewuZZqNKGumAo6Q2XQVUc"
      }
    ]
  },
  "authors": [
    {
      "name": "Ace Alliance"
    }
  ]
}
