{
  "@context": {
    "@language": "en",
    "CIP100": "https://github.com/cardano-foundation/CIPs/blob/master/CIP-0100/README.md#",
    "CIP108": "https://github.com/cardano-foundation/CIPs/blob/master/CIP-0108/README.md#",
    "intersectSpec": "https://github.com/IntersectMBO/governance-actions/blob/main/schemas/specification.md#",
    "hashAlgorithm": "CIP100:hashAlgorithm",
    "body": {
      "@id": "CIP108:body",
      "@context": {
        "references": {
          "@id": "CIP108:references",
          "@container": "@set",
          "@context": {
            "GovernanceMetadata": "CIP100:GovernanceMetadataReference",
            "Other": "CIP100:OtherReference",
            "label": "CIP100:reference-label",
            "uri": "CIP100:reference-uri",
            "referenceHash": {
              "@id": "CIP108:referenceHash",
              "@context": {
                "hashDigest": "CIP108:hashDigest",
                "hashAlgorithm": "CIP100:hashAlgorithm"
              }
            }
          }
        },
        "title": "CIP108:title",
        "abstract": "CIP108:abstract",
        "motivation": "CIP108:motivation",
        "rationale": "CIP108:rationale",
        "onChain": {
          "@id": "intersectSpec:onChain",
          "@context": {
            "governanceActionType": "intersectSpec:governanceActionType",
            "depositReturnAddress": "intersectSpec:depositReturnAddress",
            "withdrawals": {
              "@id": "intersectSpec:withdrawals",
              "@container": "@set",
              "@context": {
                "withdrawalAddress": "intersectSpec:withdrawalAddress",
                "withdrawalAmount": "intersectSpec:withdrawalAmount"
              }
            }
          }
        }
      }
    },
    "authors": {
      "@id": "CIP100:authors",
      "@container": "@set",
      "@context": {
        "name": "http://xmlns.com/foaf/0.1/name",
        "witness": {
          "@id": "CIP100:witness",
          "@context": {
            "witnessAlgorithm": "CIP100:witnessAlgorithm",
            "publicKey": "CIP100:publicKey",
            "signature": "CIP100:signature"
          }
        }
      }
    }
  },
  "authors": [
    {
      "name": "Input Output Global",
      "witness": {
        "witnessAlgorithm": "CIP-0008",
        "publicKey": "cd674a98d12e3bc0ea847ea95e354ef91ccb0ab7f7b6c7396f22ea576e263487",
        "signature": "84582aa201276761646472657373581de1e0edfd468983df75e52cc1776e0eba518023cd8f540db616e414716fa166686173686564f458209c059160ac5fe29deebb2ecebf401fb7feaad2ee1b15ef6ec60f422e8ab830fa58406ea86cd39e4efa7df67c7e32f3cdceceb96a76764003b85775b654a169e7f11a72bd24619b0dd41ddd08230e636a4a66bab1d6162bab279b6c0facbed7546803"
      }
    },
    {
      "name": "Cardano Foundation",
      "witness": {
        "witnessAlgorithm": "CIP-0008",
        "publicKey": "a535adf6786e2f8cd4bb7451e9f5b6368a037b8ed42f35b8446fb8946b7d153d",
        "signature": "845846a201276761646472657373583901acb2792c1cb10724327852ac8d03f870732c5bc8e10c22a8b80991411ef0ec112a3c73539566bde6b6abe41bb79191c1baa69edfcb0581f2a166686173686564f458209c059160ac5fe29deebb2ecebf401fb7feaad2ee1b15ef6ec60f422e8ab830fa58404bbf0ba648a6973031ce09ad3266607661de486ca8af0c37d38fd4d4b9c70d693fa2790477877f939081cdcef3e3b127aea3bb6d318acdbcea977cb323ca480b"
      }
    },
    {
      "name": "EMURGO",
      "witness": {
        "witnessAlgorithm": "CIP-0008",
        "publicKey": "0c7148d760478182ec0722c78483b4c057fa35425b1ef579f6a5ce4e40e3d591",
        "signature": "84582aa201276761646472657373581de1807b90d9b566cfa95e749836edf77bdf09207dc0825561fefbdc3a69a166686173686564f458209c059160ac5fe29deebb2ecebf401fb7feaad2ee1b15ef6ec60f422e8ab830fa58402bee5828abc09c97e60d8972f42f6fed46c492f3a0a37f790e0a8462f3bd8df9def6159129a5f792e242d7b0a24e442735434e12250d8dc5f4f856e4df4e1b00"
      }
    },
    {
      "name": "Intersect",
      "witness": {
        "witnessAlgorithm": "ed25519",
        "publicKey": "05568f86955e65c1a59df5ac1985449b167c3828dccd00b3da9df36a1cf1c743",
        "signature": "9fb82445faf0d072dc007ce7ddfe95e1dcaa5874701fadfacb92e5967f057efad50cf2645f7e1564d0c5a2436b3955fc9fc95fa88f289494b167ac1c8c7bea07"
      }
    }
  ],
  "hashAlgorithm": "blake2b-256",
  "body": {
    "title": "Withdraw ₳70,000,000 for Cardano Critical Integrations Budget",
    "abstract": "This treasury withdrawal is submitted pursuant to the Budget Info Action “Cardano Critical Integrations Budget” (gov_action13a2dqgwxum7d6kjfprcs57cf9733ek2dkt5qnuhqd4ll5ntcwu7sqluwkxd) and can only be ratified if that Budget Info Action is approved by DReps and the Constitutional Committee. This governance action  requests to withdraw ₳70,000,000 from the Cardano Treasury to establish a strategic integration fund supporting the onboarding of critical infrastructure, including tier-one stablecoins, institutional digital asset custody and wallet infrastructures, on-chain analytics platforms, cross-chain bridges, and pricing oracles to the Cardano ecosystem.\n\nThese integrations are foundational for tier-one stablecoin deployment, large scale DeFi growth, and acceleration of RWA and DePin activity, strengthening Cardano’s long term fee generation and treasury sustainability. This project is being driven through close collaboration between Input | Output Global, the Cardano Foundation, and EMURGO, together with Midnight Foundation and Intersect, all of whom are actively engaged in negotiations with integration partners. Representatives from all five organizations form the Steering Committee, which is responsible for all executive decisions over how these funds will be committed and spent. Multiple partners are already at an executable stage, but with sensitive commercial negotiations underway, vendor identities and line item costs remain confidential. Vendor identities can only be disclosed once integrations are completed.\n\nFunds will be administered by Intersect under a performance and milestone-based structure over a period of up to 24 months. Drawdowns occur only after signed integration partnership agreements are submitted and verified. The Oversight Committee, a group of five independent entities within Intersect's budget administration framework, will review each drawdown or disbursal to confirm alignment between scope, amounts, and recipients. Deployment is expected to begin shortly after enactment of this withdrawal.",
    "motivation": "### **Strategic Need**\n\nCardano has a strong technical and governance foundation, but lacks several critical integrations required for large-scale economic activity and external liquidity. The absence of key systems, including stablecoin infrastructures, interoperability frameworks, and institutional-grade pricing oracle networks limits the ecosystem’s capacity to attract external capital, facilitate stable on-chain operations, and support advanced DeFi use cases. Cardano also requires institutional digital asset custody and wallet infrastructures, as well as on-chain analytics platforms to ensure user access, ecosystem transparency, and multi-chain liquidity efficiency. While none of these integrations in themselves are ‘silver bullets’, taken as a whole, they will provide the essential foundations to connect Cardano to the wider Web3 landscape and pave the way for accelerated growth.\n\n* **Stablecoins**  \n  With data and interoperability in place, Cardano can support the introduction of a tier-one stablecoin, the ecosystem’s primary base currency. A stablecoin provides price stability, predictable liquidity, and access for both institutional and retail users. However, its deployment depends on reliable oracle data and established interoperability channels. As such, stablecoin integration is the final step in the infrastructure rollout sequence and the key enabler for large-scale DeFi adoption and sustained liquidity growth.\n\n* **Institutional Digital Asset Custodies and Wallet Infrastructures**  \n  User access and transaction flow depend on a high-quality wallet infrastructure that supports multi-asset management, seamless dApp interaction, and secure cross-chain functionality. Wallets serve as the primary interface between users and Cardano’s financial systems; therefore, scalable, reliable, and feature-rich wallet solutions are required to support onboarding, institutional usage, and mass-market adoption. Enhanced wallet capabilities also ensure that new infrastructure layers like bridges, analytics, and stablecoins remain accessible and usable for all users.\n\n* **On-chain Analytics Platforms**  \n  A mature financial ecosystem requires transparent, real-time insights into network activity, risk exposure, asset flows, and application performance. Advanced analytics platforms allow developers, institutions, compliance teams, and users to assess liquidity conditions, monitor protocol health, and make informed decisions. Without robust analytics, DeFi operations remain opaque, limiting institutional participation and hindering ecosystem-wide risk management.\n\n* **Cross-Chain Bridges**  \n  Once a reliable data layer is established, the next requirement is enabling liquidity and user movement between Cardano and other ecosystems. Bridge and interoperability infrastructures allow assets to transfer securely across blockchains, opening access to external liquidity pools and new user bases. Without these routes, Cardano remains isolated, constraining inflows of capital, developers, and institutional participants.\n\n* **Pricing Oracle Infrastructures**  \n  Oracles provide the external data required for DeFi & RWA operations, including asset pricing, risk management, and stablecoin collateralization. While current native providers deliver early coverage, Cardano still lacks a globally recognized, institution-grade pricing oracle provider. This limitation restricts the ability of major stablecoin issuers and financial applications to deploy on Cardano, as their operations require data from trusted pricing oracle networks. Establishing a robust pricing oracle infrastructure is the foundational step in enabling higher-level financial systems.\n\nThese integrations will provide the capability ‘rails’ for increased liquidity flow to Cardano which impact across ‘downstream’ metrics such as monthly active users, transaction volume, DeFi Total Value Locked (TVL), stablecoin liquidity/volume and more. However, people, incentives, products, and narratives are still needed to attract users and drive economic flow. As such, clear ecosystem KPIs, derived from the Cardano 2030 strategy that will be voted on via Info Action as a pillar of the 2026 budget, must be validated with the community as a separate workstream. Similar integrations are commonplace across leading L1 projects and, when combined with supporting activities and incentives to drive awareness and user onboarding, have demonstrated positive liquidity inflows and network value.\n\n### **Current Gap & Urgency**:\n\nDespite being a top-10 blockchain by market cap, Cardano’s TVL as of November 25, 2025 remains around $191.86 million (Source: Defillama.com), which is still far below comparable ecosystems in DeFi trading volume and TVL. This gap highlights Cardano’s limited market reach and the absence of the core primitives that other networks treat as standard utilities. Without scaling these key components, Cardano risks falling further behind in attracting dApps, liquidity, institutional partners, and large-scale integrations such as tier-one stablecoins.\n\nCardano’s growth now depends on institution grade pricing oracles and interoperability layers linking on chain applications to external networks and real world data. These integrations are capital intensive and time sensitive, yet foundational for every future financial primitive. This proposal is advanced now because priority negotiations have reached an executable stage and can be finalized upon funding.\n\n### **Why Treasury Funding**\n\nThe Cardano ecosystem needs foundational public infrastructure that every dApp depends on. Certain components cannot practically be built or licensed by individual teams; they are shared utilities that must be delivered at ecosystem scale, to unlock liquidity, attract users and developers, and enable institutional use cases. The Constitution states “The Cardano Community is expected to periodically propose one or more budgets for the ongoing operation, maintenance and future development of the Cardano”.\n\nBy placing the budget under Intersect administration, all fund flows follow constitutional guardrails: separate auditable addresses, auto-abstain delegation, milestone validation, independent audits, dispute resolution, and public reporting. This ensures full community oversight from start to finish and reinforces decentralized governance across the entire integration pipeline.\n\n### **Timeline & Current State of Governance**\n\nThis Treasury Withdrawal is submitted in parallel with the “Cardano Critical Integrations Budget” Info Action and the recent “2025 Net Change Limit Extension” Info Action. Running these actions together allows DReps to consider the full budget and the concrete withdrawal at the same time.\n\nFor the avoidance of doubt, this Treasury Withdrawal may only be enacted if, at the time of enactment:\n\n* The Cardano Critical Integrations Budget Info Action has been approved by DReps at the required threshold and has not been determined unconstitutional by the Constitutional Committee  \n* The withdrawal is being made pursuant to an approved Net Change Limit; the Constitutional Committee is in a state of confidence, is at or above its minimum required size and has voted that this Treasury Withdrawal is Constitutional.\n\nWhile this Treasury Withdrawal runs in parallel with the related Info Actions it is slightly staggered, so that DReps are able to signal their support in conjunction with the ongoing Budget Info Action, and the Constitutional Committee members will have a period of time after the Budget Info Action voting closes to assess constitutionality of this Treasury Withdrawal within the applicable govActionLifetime.\n\nIf any of these conditions are not met, including if the Cardano Critical Integrations Budget Info Action fails, if the Net Change Limit extension Info Action fails or is not in force for the relevant period, or if the Constitutional Committee is not restored to at least its minimum size, then the Treasury Withdrawal may be deemed unconstitutional.\n\n### **Steering Committee**\n\nThe Steering Committee provides high-level business direction and integration governance of this initiative. The committee oversees negotiation strategy, prioritization of integrations, and overall alignment with Cardano’s ecosystem needs. Its purpose is to ensure that each integration delivers clear strategic value and that decisions are made in the best interest of the ecosystem.\n\nThe Steering Committee operates as a five-member group representing Input | Output Global, the Cardano Foundation, EMURGO, Midnight Foundation and Intersect. These members act independently to maintain neutrality. Together, they evaluate which integrations should be onboarded first, assess ecosystem impact, and guide the negotiation of commercial and contracting terms with integration partners. The Steering Committee voting members will not be compensated from withdrawn funds and will each cover their own expenses. An amount of no more than 5% of the budget will be allocated to legal, custodian fees, administration, and compliance costs of the Administrator and connected parties.\n\nThe Steering Committee comprises representatives from each of the following organizations:\n\n* Input | Output Group  \n* Cardano Foundation  \n* EMURGO  \n* Midnight Foundation  \n* Intersect (as a non-voting member acting in the capacity of the Administrator)\n\nWhile ultimate accountability and delegated authority sits with the Steering Committee, dedicated sub-working groups will take operational responsibility across key areas such as commercial, legal, technical delivery, and communications/community engagement. Conflict of interest policies will be applied to the Steering Committee and the Treasury Reserve Smart Contract Oversight Committee members when making allocation and disbursal decisions.\n\nIn order to expedite these workstreams, a clear structure is required to ensure responsibility and accountability, both between the Steering Committee members organizations and to the community. While some elements of this structure are still being finalized, the intent is clear: collective action where coordination improves efficiency, combined with individual accountability so that responsibilities cannot become diffuse or ambiguous. For the avoidance of doubt, Intersect in its role as Administrator, commits to administering funds for the sole purpose as defined in the Budget Info Action and this Treasury Withdrawal.",
    "rationale": "The Cardano Critical Integrations Budget will use the requested ₳70,000,000 to cover:\n\n**• Integration and other necessary associated costs**  \nCover the integration work and all related expenses, including deployment development, licensing fees, maintenance costs, and any additional infrastructure required to support the integrations.\n\n**• Legal and Audit**  \nCover due diligence, legal, insurance, and compliance requirements, and periodic independent audits to satisfy the requirements of the Cardano Constitution.\n\n**• Contingency Reserve**  \nMaintain a reserve to accommodate scope adjustments or market shifts, while preserving delivery certainty and financial discipline.\n\n**• Admin Fees**  \nCover custody fees, minting fees of stablecoins, and any other administrative costs that may arise during setup and execution of the Cardano Critical Integrations Budget.\n\n₳70,000,000 reflects the estimated remaining capacity under the 2025 Net Change Limit and is based on consolidated cost estimates across the priority integration pipeline. This level of funding provides sufficient runway to secure high impact integrations as they become executable, allowing the Steering Committee to move quickly and support multi-year commercial terms where required.\n\n### High-level budget breakdown\n\nAs stated in the corresponding Budget Info Action, confidentiality obligations applied by most integration partners limit the level of detail that can be publicly disclosed. For that reason, this breakdown is presented on a high level, roughly estimated basis and does not include vendor specific line items. The Steering Committee is being entrusted with all executive decisions on how to use these funds to advance the interests of the Cardano Blockchain Ecosystem and unused funds at the end of the 24 month period will be returned to the Cardano Treasury.\n\nWe acknowledge DReps feedback on the budget breakdown and we recognize the balance the community expects between transparency and the commercial realities of negotiations. In complex, multi party technical integrations, contracting and delivery naturally take time, and partners often require confidentiality while agreements are being finalized. Most business contracts include confidentiality terms, and it's common for these terms to specifically mention and protect sensitive deal-related information like costs, as well as other financial data, strategies, and proprietary information. These provisions, often in the form of a non-disclosure agreement (NDA) or a clause within a larger contract, are essential for protecting a company's competitive edge. We take those obligations seriously, because honoring them is essential to securing and maintaining these relationships for the ecosystem.\n\nWithin those limits, we will share as much as partner agreements allow. This includes:  \n • Integration categories and high level scope  \n • Milestone completion and progress updates  \n • Aggregate spend reporting  \n • Outcomes delivered\n\nWhile some integrations will require a degree of longer-term assurance to the contracting party, exit terms are part of the negotiation and any unreasonable exclusivity or ‘lock in’ clauses will be avoided.\n\nWe anticipate that achieving our full vision may require additional funding in future governance cycles, but this initial allocation allows us to demonstrate value and action before requesting further resources. Requests for further funding will require an additional Budget Info Action, which will entail reporting to the Community of work delivered to date in order to allow the DReps to vote on the additional budget.\n\nA high-level, preliminary, budget breakdown is provided below, this may be updated in time in subsequent reporting, insofar as confidentiality obligations allow:\n\n| Category | Allocation (₳) | Allocation % | Description |\n| :---- | :---- | :---- | :---- |\n| **Integration costs** | 65,000,000 | 93% | It includes the full range of fees required for the integrations referenced in the Motivation section, including integration, licensing, and maintenance fees, as well as other related costs. |\n| **Legal, contract administration, and compliance costs**  | 3,500,000 | 5% | Due diligence, independent audits, and legal & compliance |\n| **Contingency Reserve** | 1,500,000  | 2% | Flexibility for scope or market shifts |\n| **Total** | **70,000,000** |  |  |\n\n### **Administration of Funds**\n\nThis treasury withdrawal is submitted by Intersect in its role as the Administrator, with endorsement and the collaboration of the Cardano Foundation, Input Output Global, and EMURGO as co-proposers. All treasury funds will be administered by Intersect as an Administrator under Cardano’s constitutional framework. All treasury funds for this initiative will be administered by Intersect under Article IV of the Constitution, using the Treasury Reserve Smart Contract Framework. Intersect acts as the Administrator for the entire budget. Contracting for integrations will be assigned by the Steering Committee based on the ‘best fit’ entity that has the required skills, stability, and capacity.\n\n#### Steering Committee Authority\n\nThe Steering Committee will negotiate commercial terms with integration partners and will include a technical assessment of feasibility and implementation requirements.\n\nAllocations from this budget will be approved by the Steering Committee. The quorum for any budget allocation to an integration will be 3/4 of all Steering Committee members. Once an integration is approved, Intersect will administer and execute the associated disbursements to the contracting entity, as defined for each integration.\n\nThe Steering Committee will publish progress reports upon achieving integration milestones\n\n## **Role of Intersect and Contractual Counterparties**\n\nIntersect will receive the funds and administer this budget. Intersect will also, in its capacity as a Constitutional Administrator, receive regular reporting and insight into budget expenditure. Upon enactment of this governance action, the funds will be received into the Treasury Reserve Smart Contract framework administered by Intersect with withdrawal data verification provided by the independent smart contract Oversight Committee made up of five members; the Cardano Foundation, NMKR, Xerberus, SundaeLabs, and Dquadrant. Cardano Foundation will abstain where appropriate should a conflict of interest arise between this role and its role in the Steering Committee.\n\nFunds from there will be disbursed according to the contracting arrangements. Disbursements will be made directly from the smart contract framework or an institutional-grade custodian to vendors, as selected by the Steering Committee. It is currently not envisioned that the smart contract framework deployed earlier this year will be fully utilized in so far as specific vendor smart contracts being established as this will likely result in disclosure of integration costs, which are typically confidential and protected by non-disclosure agreements. For the sake of completeness and as mentioned previously, the main Treasury Reserve Smart Contract will be the recipient address for this withdrawal, which remains in constitutional compliance. Intersect and the co-proposers will endeavor to negotiate integration contracts that allow for as much public disclosure as reasonably possible and the Steering Committee will disclose such information in their progress reports.\n\nCo-proposers or other entities chosen by the Steering Committee from time to time may, if required, act as the contracting counterparty with an integration partner. When this occurs, Intersect and the Cardano Development Holdings will enter into a contract with the designated entity defining the scope, obligations, reporting requirements, and drawdown conditions. Under this arrangement, the designated entity receives disbursements from related smart contract/s or custodians as determined by the contract terms.\n\nIntersect will only act as a contracting counterparty when it has completed its own due diligence and satisfied its Delivery Assurance standards. If Intersect declines to act as counterparty for a specific integration, another designated entity may do so, provided that a contract is established between that designated entity, Intersect and Cardano Development Holdings for the purpose of receiving and managing budget disbursements.\n\nAll contracts established under this program will include clearly defined scope, obligations, reporting requirements, drawdown conditions, and dispute resolution provisions, in order to comply with Article IV.4 of the Constitution.\n\n## **Payment Execution and Safeguards**\n\nDisbursements will be executed through either smart contracts or institutional-grade custodians. These disbursements will follow the Statements of Work and the commercial terms approved by the Steering Committee.\n\n## **Unused funds and program conclusion**\n\nIf at the end of the 24 months period the budget has not been fully utilized, all remaining funds will be returned to the Cardano Treasury. A final reconciliation and summary will be included in the oversight reporting by Intersect, in collaboration with the Steering Committee.\n\n### **Cardano Addresses**\n\nTreasury funds will be received and held by Intersect, acting as the Constitutional Administrator,  the following address addr1xxzc8pt7fgf0lc0x7eq6z7z6puhsxmzktna7dluahrj6g6v9swzhujsjlls7dajp59u95re0qdk9vh8mumlemw89535s4ecqxj (with stake account stake17xzc8pt7fgf0lc0x7eq6z7z6puhsxmzktna7dluahrj6g6ghh5qjr) which is publicly viewable.\n\nTo fulfil constitutional requirements, this address will be delegated to the Auto-Abstain DRep and will not be staked to any Stake Pool Operator (SPO), ensuring that the funds do not influence governance or generate staking rewards. Intersect will ensure oversight and transparency through the independent audit and access to information.\n\nThrough this arrangement, the Cardano Development Holdings administered by Intersect, maintains full custody transparency, enabling verifiable auditing and milestone tracking under Cardano’s constitutional governance framework, satisfying Articles IV(2), (4) & (5) in particular.\n\n### **Acceptance Criteria and Milestone-Based Disbursement**\n\nThe acceptance criteria will vary between vendors, but will be made public once commercial terms and contracting has been agreed between the vendor, Intersect and the Steering Committee. It is expected a “milestone zero” payment will cover the essential setup costs of this initiative, which may include converting ada into a stablecoin, stablecoin minting fees, and custody fees. Converted assets will be held in a regulated custodian. Legal costs for onboarding integration partners are also included in this early operational budget.\n\nAny conversion of ada into stablecoins or other assets will occur only as part of an approved disbursement under a Statement of Work, and only after the relevant ada has left the Administrator’s dedicated, auto abstain delegated accounts in accordance with Article IV.5.\n\nIn general, integration partners will receive funds only after verified delivery of agreed technical and operational milestones. That said, payment structures may vary deal to deal. Where a partner requires funds in advance to commence delivery, an upfront payment may be made at the point of contract signature.\n\nIntegrations requiring ongoing support may receive additional approved maintenance payments during the program period.\n\nThis disbursement structure ensures efficient execution, transparent financial management, and strict alignment with Cardano’s governance requirements.\n\n### **Reporting**\n\nIntersect and the Steering Committee will publish a bi-annual report covering:\n\n1. **Financial Summary & Treasury Reconciliation** – total funds disbursed, remaining, and audited.  \n2. **Project Progress & Milestone Review** – integration status and outcomes.  \n3. **Audit & Compliance Statement** – summary of independent audit findings.  \n4. **Ecosystem Impact Assessment** – measurable effects on Cardano adoption and interoperability.  \n5. **Governance & Future Outlook** – proposed next steps or renewal recommendations.\n\n## **Constitutionality Checklist**\n\n### **Article III.5**\n\n✔️ This proposal is prepared in a standardized and legible format and will include a URL and hash of all off-chain materials at submission. It provides a clear title, abstract, rationale, motivation, and supporting information in accordance with this article.\n\n### **Article IV.1**\n\n✔️ This proposal fits the purpose of Article IV.1 as it supports the maintenance, operation, and future development of the Cardano ecosystem through critical integrations.\n\n### **Article IV.2**\n\n✔️ This proposal specifies Intersect as the administrator and outlines transparent reporting, an oversight structure and explains where the processes are or are not administered via smart contracts (where it is not possible or beneficial). These elements meet the constitutional requirement for the use of administrators and on-chain tools where beneficial.\n\n### **Article IV.3**\n\n✔️ ”2025 Net Change Limit Extension” Info Action (gov_action169kllwhfmp488je5x5rwvufd08p8sztdcf0ghf5sp6ey2gnjdwaqql47xry) to extend the 2025 NCL is currently underway. If accepted, the NCL will remain in effect from Epoch 605 to Epoch 612, removing any ambiguity in covering this proposal’s withdrawal window and keeping the ₳70,000,000 request within the applicable NCL, thereby satisfying Article IV.3.\n\n✔️ This treasury withdrawal will be made in alignment with the relevant Budget Info Action.\n\n### **Article IV.4**\n\n✔️ This proposal allocates a budget for independent audits and includes clear oversight metrics & mechanisms such as contractual milestone-based verification, bi-yearly reporting, dispute resolution provisions (to be included in relevant legal contracts), and a defined Steering Committee. These elements satisfy the constitutional requirements for audits and oversight metrics.\n\n### **Article IV.5**\n\n✔️ All ADA withdrawn will be held by Intersect in dedicated, publicly viewable addresses that will not be delegated to any SPO and will be delegated to the Auto-Abstain voting option.\n\n### **GUARDRAILS: TREASURY 02a**\n\n✔️ This treasury withdrawal confirms that the requested ₳70,000,000 will not breach the applicable Net Change Limit for the relevant period at submission or enactment (subject to the NCL extension being approved).\n\n### **GUARDRAILS: TREASURY 03a**\n\n✔️ The requested amount in this proposal is denominated in ADA\n\n### **GUARDRAILS: TREASURY 04a**\n\n✔️ This treasury withdrawal will only be eligible for ratification after, and only if, the community approved the corresponding Budget Info Action in effect with DRep approval above the 50 percent threshold. This sequencing aligns with the prerequisite budget requirement for withdrawals.",
    "references": [
      {
        "@type": "Other",
        "label": "Cardano Constitution",
        "uri": "ipfs://bafkreiazhhawe7sjwuthcfgl3mmv2swec7sukvclu3oli7qdyz4uhhuvmy"
      },
      {
        "@type": "Other",
        "label": "Definitions for the Cardano Constitution",
        "uri": "ipfs://bafkreiewp5bgrdiesq6ft3qypykgcjhvfgpp4s5o4yrjrvko4wuhi4iecu"
      },
      {
        "@type": "Other",
        "label": "Automating Accountability: Cardano's Smart Contract Framework Blog",
        "uri": "ipfs://bafybeihqx4ae72z7suqfnxrpqpqithp43cai7o2uuewnqtezgaoyc3ptyq"
      },
      {
        "@type": "Other",
        "label": "Sundae Labs Budget Management Smart Contracts Github Repository",
        "uri": "https://github.com/SundaeSwap-finance/treasury-contracts"
      },
      {
        "@type": "Other",
        "label": "Budget Management Smart Contracts TxPipe Audit Report",
        "uri": "ipfs://bafybeiccnwejbgj43wo6hrlseckkkmprtoqc5cfuy2hesm6c6yealwho3e"
      },
      {
        "@type": "Other",
        "label": "Budget Management Smart Contracts MLabs Audit Report",
        "uri": "ipfs://bafybeiah5fnjhda5hemj3qvaehc4mre3qllqzw2l7mkdsguytn4ftgafw4"
      }
    ],
    "onChain": {
      "governanceActionType": "treasuryWithdrawals",
      "depositReturnAddress": "stake1uyvjdz9rxsfsmv44rtk75k2rqyqskrga96dgdfrqjvjjpwsefcjnp",
      "withdrawals": [
        {
          "withdrawalAddress": "stake17xzc8pt7fgf0lc0x7eq6z7z6puhsxmzktna7dluahrj6g6ghh5qjr",
          "withdrawalAmount": 70000000000000
        }
      ]
    }
  }
}
