{
  "@context": {
    "@language": "en",
    "CIP100": "https://github.com/cardano-foundation/CIPs/blob/master/CIP-0100/README.md#",
    "CIP108": "https://github.com/cardano-foundation/CIPs/blob/master/CIP-0108/README.md#",
    "hashAlgorithm": "CIP100:hashAlgorithm",
    "body": {
      "@id": "CIP108:body",
      "@context": {
        "references": {
          "@id": "CIP108:references",
          "@container": "@set",
          "@context": {
            "GovernanceMetadata": "CIP100:GovernanceMetadataReference",
            "Other": "CIP100:OtherReference",
            "label": "CIP100:reference-label",
            "uri": "CIP100:reference-uri",
            "referenceHash": {
              "@id": "CIP108:referenceHash",
              "@context": {
                "hashDigest": "CIP108:hashDigest",
                "hashAlgorithm": "CIP100:hashAlgorithm"
              }
            }
          }
        },
        "title": "CIP108:title",
        "abstract": "CIP108:abstract",
        "motivation": "CIP108:motivation",
        "rationale": "CIP108:rationale"
      }
    },
    "authors": {
      "@id": "CIP100:authors",
      "@container": "@set",
      "@context": {
        "name": "http://xmlns.com/foaf/0.1/name",
        "witness": {
          "@id": "CIP100:witness",
          "@context": {
            "witnessAlgorithm": "CIP100:witnessAlgorithm",
            "publicKey": "CIP100:publicKey",
            "signature": "CIP100:signature"
          }
        }
      }
    }
  },
  "authors": [],
  "hashAlgorithm": "blake2b-256",
  "body": {
    "abstract": "This Cardano Constitution is proposed to replace the Interim Constitution. The Cardano Constitution is the result of extensive Cardano community consultation throughout 2024. The Interim Constitution was intended to be temporary, and its Appendix II: Ratification of Final Constitution required its replacement to be submitted on-chain no later than January 31, 2025.",
    "motivation": "**CIP-1694**\nThe age of Voltaire for the Cardano Blockchain laid out the foundations for decentralized decision-making. To give effect to true governance by all ada owners, including on-chain voting, members of the Cardano Community worked together for more than a year, holding global workshops, to ultimately approve a Cardano Improvement Proposal, CIP-1694, that provides a governance system to bring decision making for the Cardano Blockchain network on-chain. CIP-1694 was first published November 18, 2022, as a minimum viable on-chain governance framework. CIP-1694 assures that every ada owner has a voice in Cardano’s governance. Following these global workshops and extensive Cardano Community participation, a refined version of CIP-1694 emerged.\n\nPursuant to CIP-1694, the Cardano Community is now able to present proposals, such as this proposal, to improve and update the Cardano Blockchain network. To enable this, a set of rules, parameters and guardrails must be in place to secure the safety and security of the Cardano Blockchain. CIP-1694 requires that these rules, parameters and guardrails be set out in a constitution that defines Cardano's shared values and guiding principles.\n\n**Chang Hard Fork**\nTwo upgrades (or hard forks) to the Cardano Blockchain protocol were required to fully give effect to CIP-1694. The first upgrade, Chang Hard Fork, was initiated by the Genesis Key Holders and approved by Cardano Blockchain stake pool operators (SPOs) and became effective on September 1, 2024.  The Chang Hard Fork deployed the initial on-chain governance features to the Cardano Blockchain and ushered in an interim (or bootstrap phase) for Cardano Blockchain on-chain governance as described in CIP-1694.\n\nTo give effect to the bootstrap phase of minimum viable on-chain governance, as required by CIP-1694, an interim Cardano Blockchain constitution was published on June 21, 2024.  This interim constitution is a temporary governing document containing only the minimal  requirements necessary for Chang Hard Fork to be implemented.  The bootstrap phase also required that an interim Constitutional Committee be elected by the Cardano Community. Once the Cardano Constitution is approved pursuant to an on-chain vote, the interim constitution will be replaced.  The term of the interim Constitutional Committee members expires in September 2025 (Epoch 580) and at that time the Cardano Community will be able to elect a new Constitutional Committee.\n\n**Plomin Hard Fork**\nThe second upgrade (or intra-era hard fork) to the Cardano Blockchain moved CIP-1694 out of the interim bootstrap phase and into full minimum viable on-chain governance as described in CIP-1694. To fully implement on-chain governance, the Cardano Community will now need to ratify this proposed Cardano Constitution on-chain.\n\n**Achieving Consensus on the Cardano Constitution**\nOn behalf of the Cardano Community, the Constitution Ratification Working Group (CRWG) of the Cardano Civics Committee of Intersect brought together representatives of the Cardano Community, blockchain governance and constitutional scholars and the Cardano Parameter Committee to develop the Cardano Constitution.\n\nUsing the Interim Constitution as a starting point, this group prepared a first draft of a constitution that was then submitted in July 2024 to representatives from the Cardano Community who volunteered to participate in a series of global community workshops. Between July and October 2024, 63 workshops were held in over 50 countries and involved more than 1,400 participants.\n\nEach workshop, as well as others from the Cardano Community via an online open form, reviewed and provided feedback and recommendations on the July draft. Each workshop also elected a Constitutional Delegate and Alternate to represent the views of their workshop at the Constitutional Convention.\n\nAs part of helping to organize the 63 global workshops, the CRWG identified the most complex issues that arose from the initial drafting process. The CRWG asked workshops to provide feedback on these issues. Each workshop chose which issues they particularly wanted to focus on. Output from the workshops, together with open-ended community feedback, shaped the edits that were made to the July draft.\n\nThe workshop data was reviewed by the CRWG and Parameter Committee, as well as the group of blockchain governance and constitutional scholars and turned into proposed revisions. The Delegates and Alternates met in a series of online and in-person workshops to synthesize the output from the global workshops and review the resulting proposed revisions to the draft Constitution. In these workshops, Delegates were asked to review the proposed changes in light of their workshop’s feedback and work as a group to settle on the best path forward. This often took the form of debates, problem solving, and compromise. Using that output, the Delegates and Alternates, again working with the CRWG, the Parameter Committee and a group of blockchain governance and constitutional scholars, revised the July draft constitution. That work resulted in a subsequent 20 November 2024 draft constitution that was released to the Cardano Community.\n\nBased on further community feedback, the Delegates and Alternates continued to review and make additional revisions to the November draft. They also took into consideration other community input including a draft constitution that was published by the Cardano Foundation and based on the November draft. Delegates, Alternates and other Cardano Community members continued to iterate on the draft constitution until reaching final consensus at the Constitutional Convention. The proposed Cardano Constitution was overwhelmingly approved by the Delegates at the Constitutional Convention by a 95% margin. On that basis, the Delegates and CRWG are putting forward this governance action for consideration by all owners of ada.\n\nNevertheless, the CRWG, the Delegates, Alternates and others involved in the drafting process all recognize that the proposed Cardano Constitution is not perfect. It is not an end, only the beginning. Over time, as all those involved to date recognize, the Cardano Constitution may need to be revised and improved. The Cardano Constitution also acknowledges this by providing an amendment process.\n\nFurther, in the Delegate synthesis workshops, the Delegates and Alternates identified a number of future governance workstreams. The Cardano Community will be invited to organize and participate during 2025 in various future governance workshops. These future workshops will focus on various governance considerations such as governance processes and procedures that should not appropriately be included in a constitution, governance processes that the Constitution requires the community to implement to give effect to various constitutional mandates, and potential future amendments to the Constitution that may become appropriate based on review and feedback as to how governance processes are working.",
    "rationale": "As defined in the Interim Constitution’s Appendix II: Ratification of Final Constitution, the criteria have been met to submit the Cardano Constitution which replaces the Interim Constitution:\n\n1. A series of global workshops for Ada holders to discuss and debate the Articles of a final constitution will commence during the second half of 2024: 2 beta workshops and 63 constitutional workshops were held from July - October 2024.\n2. Workshops shall be geographically distributed to capture the breadth of sentiment in the Cardano community: the 63 workshops took place in 52 countries.\n3. Workshops shall elect up to a total of one hundred and forty delegates comprising up to seventy voting delegates and up to seventy non-voting alternate delegates, who shall participate in a Constitutional Convention. Each voting delegate participating in the Constitutional Convention shall have an equal vote: 63 voting delegates and 63 non-voting alternates were elected by the workshop attendees.  63 delegates cast their vote, each with one vote, at the Constitutional Convention on 5 December 2024.\n4. The Constitutional Convention shall be held no later than the end of 2024: The Constitutional Convention was in session from 4-6 December 2024.\n5. The Final Constitution shall be approved at the Constitutional Convention where delegates elected to attend the Constitutional Convention shall agree to the Final Constitution with such amendments as they deem appropriate and necessary: The Final Constitution was approved by the Delegates at the Cardano Convention by a 95% margin.\n6. The Final Constitution as approved at the Constitutional Convention shall be submitted as a governance action in accordance with CIP-1694 no later than January 31, 2025: This governance action, containing the Constitution as approved at the Constitutional Convention, was submitted on 30 January, 2025.",
    "references": [
      {
        "label": "Delegate Approved Constitution up for vote",
        "@type": "Other",
        "uri": "ipfs://bafkreiazhhawe7sjwuthcfgl3mmv2swec7sukvclu3oli7qdyz4uhhuvmy"
      },
      {
        "label": "Definitions for the Delegate Approved Constitution ",
        "@type": "Other",
        "uri": "ipfs://bafkreiewp5bgrdiesq6ft3qypykgcjhvfgpp4s5o4yrjrvko4wuhi4iecu"
      },
      {
        "label": "Supporting information about the Delegate Approved Constitution",
        "@type": "Other",
        "uri": "ipfs://bafybeidf4rqxgodfaajo3zwzcofyys4sl7dns4fsflq7c2tmjrvc3f7hqm"
      },
      {
        "label": "Draft constitution provided to the Constitutional Workshops",
        "@type": "Other",
        "uri": "ipfs://bafybeigrg4ew43et23kgphs24flf4rspw2gpylus5ztuikwhxewg66pz5u"
      },
      {
        "label": "Issues presented to the Constitutional Workshops for debate and input",
        "@type": "Other",
        "uri": "ipfs://bafkreiaahkoi43kzobyurdnbssgntoxr3ewv4qehqvb5jcn4ytfa3w326m"
      },
      {
        "label": "1,400 Constitutional Workshop participants ",
        "@type": "Other",
        "uri": "ipfs://bafybeifbd5d4apao7h73ydlyirikmrzqhxhqa6qxgu4dny5d3qssl2vcry"
      },
      {
        "label": "63 Constitutional Workshop results",
        "@type": "Other",
        "uri": "ipfs://bafybeihvj5mviuivmsw2n72xgzuix2rug774fqlmdz7yjzgsxextvj7ywu"
      },
      {
        "label": "Constitutional Delegate Synthesis Workshops",
        "@type": "Other",
        "uri": "ipfs://bafkreib5dlpmkngxee2w36gj2tuzy7csvsqkpd37d2qpxbhqktm7joocoi"
      },
      {
        "label": "20 November 2024 Draft Constitution",
        "@type": "Other",
        "uri": "ipfs://bafybeia27ykgiihzdiwapu3vgfpb4utljpkchikvsc25lusw45w2jgs5le"
      },
      {
        "label": "Constitutional Convention Archivist Notes, December 4, 2024",
        "@type": "Other",
        "uri": "ipfs://bafybeiglsbn26td6t5zc2tbaat3hhghiawaq4n5l5o5xljv3z566voyn5u"
      },
      {
        "label": "Constitutional Convention Archivist Notes, December 5, 2024",
        "@type": "Other",
        "uri": "ipfs://bafybeie2ycw6voupzeg3tfs6bthnnczek5e6573kshlnhxfql6javv2xcq"
      },
      {
        "label": "Constitutional Convention Archivist Notes, December 6, 2024",
        "@type": "Other",
        "uri": "ipfs://bafybeidaqbljnelwxkojp4mek3dgav3tjgosxboloa7wplmmz45xhb23gq"
      },
      {
        "label": "Cardano Transaction Hash of the Constitutional Convention Vote",
        "@type": "Other",
        "uri": "ipfs://bafkreiawz7kwlnehgatptxcol4cijanjhf3xpoweplhfivtpxlq5wuaowa"
      },
      {
        "label": "List of contributors to the Cardano Constitution",
        "@type": "Other",
        "uri": "ipfs://bafkreicnb6jengfum7mk6yrac5kzurf2q2ajm2ekk4b2tu2hddmmvzumtm"
      }
    ],
    "title": "Cardano Constitution to Replace the Interim Constitution"
  }
}
